[
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I requested bank statements and the…",
        "commentaire": "I requested bank statements and the request was fulfilled within 15 minutes. Great customer service!\n\nThe only feedback I would provide is having a place online to view the statements in PDF format so customers could download them without having to request them in the future. This would remove the extra step of requesting them.",
        "nombre_reviews": 1,
        "date_experience": "June 18, 2024",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great experience",
        "commentaire": "I had multiple scam charges ending in a negative balance with OD charges and I worked with Rebecca Lanefski and we were able to resolve all my account issues quickly and she was very delightful, knowledgeable, and easy to work with. Thank you Rebecca and thank you evergreen for your support!!!!",
        "nombre_reviews": 1,
        "date_experience": "June 18, 2024",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "All my questions were answered in a…",
        "commentaire": "All my questions were answered in a timely manner and customer service was awesome.\n\nThank you",
        "nombre_reviews": 1,
        "date_experience": "June 07, 2024",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Easy and pleasant to deal with",
        "commentaire": "Easy and pleasant to deal with, understanding and helpful",
        "nombre_reviews": 1,
        "date_experience": "June 10, 2024",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Best Ever Banking Experience",
        "commentaire": "Casey has been amazing to work with. I have been waiting for a vehicle to arrive for months and through the entire process, Casey has been informative, responsive and friendly. I am a first time customer and I am so impressed. When I told the finance department at the dealership our rate, they said they wouldn’t even try to match it because they couldn’t get close. My husband is a veteran and we really appreciate the rate discount. It’s an incredible thing to do. Thank you for being the bright side of buying a car.",
        "nombre_reviews": 1,
        "date_experience": "May 23, 2024",
        "reply": {
            "reply_text": "Hi Lindsay,\n\nWe're glad Casey helped you in so many ways! Thank you for sharing your experience with us.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, May 28, 2024 at 08:03:06 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Rebecca did a wonderful job",
        "commentaire": "Rebecca did a wonderful job! My problem was handled quickly, friendly, and with professionalism. Always love working with the folks at Evergreen.",
        "nombre_reviews": 1,
        "date_experience": "May 31, 2024",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Exceptional Service From Entering to Exiting!",
        "commentaire": "We wanted to extend our gratitude to the exceptional team that works at the Riverside Evergreen Credit Union branch. The atmosphere promoted at ECU is inviting, friendly, professional, efficient, and caring. Whether you are making a deposit, lost your debit card, or are taking out a loan... you will be taken care of by this incredibly accommodating and lovely team.\n\nThank you for the many years of exceptional service!",
        "nombre_reviews": 1,
        "date_experience": "May 10, 2024",
        "reply": {
            "reply_text": "Thank you, Noyes Family! We're always happy to help.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Thursday, May 16, 2024 at 03:29:14 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I was anxious when I called egcu.org on…",
        "commentaire": "I was anxious when I called egcu.org on Monday March 30, 2024. I spoke with Sara Adams and an IT person (Paul?). Sara is an asset to the establishment, helpful and knowledgeable. I want this commendation to be part of her permanent personnel record and for her to be recognized for her fast, courteous service! Thank you Sara.\nLinda A. McCann",
        "nombre_reviews": 1,
        "date_experience": "May 01, 2024",
        "reply": {
            "reply_text": "Hi Linda,\n\nThank you very much for sharing your experience with us, and highlighting Sarah and Paul! We're glad they were able to give you peace of mind.\n\nAll the best,\nEmma\nEvergreen CU",
            "reply_date": "Thursday, May 16, 2024 at 03:28:38 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "SE",
        "Titre": "Security",
        "commentaire": "I called the Evergreen's Portland location on Saturday, 04.20.2024. It seemed a log in change had been made which asked if I were an adult. The posting was done by Cloudflare.\nThe potential for a possible scam or worse gave me pause before answering. The 'authentication' (I guess) somehow gave sufficient proof so I was then able to log into my account.\nI also had a rather minor request to edit the names on specific accounts.\nMy call was taken by Danielle and together we were able to address and resolve.\nHaving employees who feel professional yet personable service are critical in securing confidence in both Evergreen and their employees.\nYour mission and mine were met by Danielle.",
        "nombre_reviews": 1,
        "date_experience": "April 20, 2024",
        "reply": {
            "reply_text": "Hi Ken,\n\nThank you for sharing you Evergreen Experience with us! We're happy to see that Danielle helped answer your questions. As always, please let us know if you have any questions about your account.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:35:42 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Best Credit Union",
        "commentaire": "I have been with Evergreen Credit Union for many, many years and look forward to many more years. in all of those years everyone associated with Evergreen has been helpful and a pleasure to do business with and very, very pleasant. This includes everyone tellers, customer relations people, mid level management, top dogs. I could thank a lot of the staff by name at the credit union but it would include everyone. I would like to congratulate Evergreen Credit Union for building such a fine organization. Evergreen Credit Union is a wonderful partner and participant in the neighborhood and beyond. Kudo's Evergreen keep up the good work.",
        "nombre_reviews": 1,
        "date_experience": "April 29, 2024",
        "reply": {
            "reply_text": "Hi Donna,\n\nThank you very much for the kind words! We're so happy to have built a credit union that can serve community members just like you.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:38:20 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "My call to Member Services was answered…",
        "commentaire": "My call to Member Services was answered immediately. Rebecca fixed my issue promptly and walked me through the process until it was resolved. I appreciate this level of customer service. It is rarer these days and certainly doesn't go unnoticed. Thank you!",
        "nombre_reviews": 1,
        "date_experience": "March 21, 2024",
        "reply": {
            "reply_text": "Thank you for your review, Joshua! We're happy Rebecca was able to efficiently resolve any issues you had!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, March 26, 2024 at 03:48:21 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great people and banking experiences",
        "commentaire": "I have known about Evergreen Credit Union since my grandmother was a member when it was SD Warren credit union in Westbrook. Evergreen has helped me many times with not only banking but personal & auto loans as well as my family and friends. The staff I have worked with & interacted with at Evergreen are friendly, personable and willing to help whatever my needs might be. I feel good knowing I can make a call and whomever I speak with will try to help or find someone who can, and I look forward to many more year's banking with Evergreen. Thank you!",
        "nombre_reviews": 1,
        "date_experience": "February 21, 2024",
        "reply": {
            "reply_text": "Thank you, Heidi! We love hearing about families coming to Evergreen. We're happy to help.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:51:31 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Happy customers…",
        "commentaire": "We like having our financial services locally. We have been With Evergreen Credit Union for over 30 years. They have very knowledgeable representatives who go out of their way to help us. They are truthful with their dealings with us. It is nice to know we can get the solution that fits our needs, at a reasonable price.",
        "nombre_reviews": 1,
        "date_experience": "February 09, 2024",
        "reply": {
            "reply_text": "We're happy to help you every step of the way, Denise. Thank you for your long-term membership, and for sharing your experience with us!\n\nBest,\nEvergreen CU",
            "reply_date": "Tuesday, February 20, 2024 at 07:56:52 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "We found Judy Brochu to be sincerely…",
        "commentaire": "We found Judy Brochu to be sincerely warm and friendly. Anyone can read a script but Judy was obviously doing more than that.\n\nShe was knowledgeable and patient and took our information and passed it on by email to the correct department. A few days later the outcome that we requested showed up on our Consolidation Loan.\n\nThank you, Judy.\n\nJohn and Rose Duran",
        "nombre_reviews": 1,
        "date_experience": "November 21, 2023",
        "reply": {
            "reply_text": "Hi John and Rose,\n\nThank you for sharing your experience with us! We're glad Judy helped you with your loan needs.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, December 26, 2023 at 06:58:07 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Chelsey C has helped me…& continues to…",
        "commentaire": "Chelsey C has helped me…& continues to help me….as I rebuild following divorce. She is kind & empathetic…she works hard for creative solutions…& has helped me tremendously….allowing me to see the steps I need to take to achieve my goals. She is a true and genuine treasure. ECU is lucky to have her.",
        "nombre_reviews": 1,
        "date_experience": "March 01, 2024",
        "reply": {
            "reply_text": "Thank you for sharing your experience with us! Chelsey is amazing, and we're glad she has helped you time and time again.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:52:29 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Efficiency",
        "commentaire": "The woman in the office to the left as you enter the bank (Julie?) helped us as she could see that the tellers were busy. She invited us into her office and helped us with a kind and professional manner. Always a warm and welcoming experience at the South Portland branch. We are excited about the new branch in Scarborough opening.",
        "nombre_reviews": 1,
        "date_experience": "December 21, 2023",
        "reply": {
            "reply_text": "Thank you, Lisa! We're happy you had a great experience at our South Portland branch. We're very excited to open our Scarborough branch!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, January 2, 2024 at 04:15:32 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "The staff is courteous",
        "commentaire": "The staff is courteous, respectful and knowledgeable about my questions and concerns. They are extremely responsive whether in person or on the phone. They always thank me for being a customer. I was with a bank for 45 years prior to joining Evergreen and never felt appreciated the way I have since joining Evergreen. I have already referred a number of friends to join.",
        "nombre_reviews": 1,
        "date_experience": "February 20, 2024",
        "reply": {
            "reply_text": "Thank you for leaving a review, Mary! We're happy to help, and lucky to have you as a member.\n\nBest,\nEvergreen CU",
            "reply_date": "Thursday, February 29, 2024 at 07:51:57 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Sara was excellent today",
        "commentaire": "Sara was excellent today! She was able to explain all the necessary details about changing our account, and was very helpful in terms of knowing how to best go forward. She was very patient, considerate and demonstrated excellent customer service skills. We would recommend her to anybody, thanks so much Sarah",
        "nombre_reviews": 1,
        "date_experience": "January 25, 2024",
        "reply": {
            "reply_text": "Hi Rosie,\n\nThank you for sharing your experience with us! We're happy Sara was able to answer your questions about our accounts and how to move forward in the best way for you.\n\nBest,\nEvergreen CU",
            "reply_date": "Wednesday, January 31, 2024 at 01:47:15 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Thanks to ECGU's debit/credit card fraud staff",
        "commentaire": "I really appreciate the debit/credit fraud department of Evergreen Credit Union. They have caught unauthorized use of my debit card at least twice, and had my new card waiting for me at the credit union within half an hour. All the staff have been very helpful, pleasant, efficient and have saved me a lot of grief by catching fraudulent use of my debit card.",
        "nombre_reviews": 1,
        "date_experience": "March 01, 2024",
        "reply": {
            "reply_text": "Thank you for leaving a review with us, Diana! We're happy to bring you ease of mind. As always, give us a call if you have any questions.\n\nBest,\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:50:26 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Excellent Service from Cassandra Hanson",
        "commentaire": "Great experience with Cassandra Hanson and a lease to used-car loan. These can be complicated, starting with the lease lienholder. Cassandra made it easy. Also, I would like to include Isiah, who I initially contacted, and he gave me some good tips on getting the loan process started.\n\nEvergreen has had a great team since its humble beginnings in South Portland and looking forward to the new branch opening in Scarborough.",
        "nombre_reviews": 1,
        "date_experience": "September 22, 2023",
        "reply": {
            "reply_text": "Hi Alan,\n\nThank you for leaving a review with us. We're excited to see Scarborough open as well, and see our already amazing team get even bigger and better!\n\nBest,\nEmma P.\nEvergreen Credit Union",
            "reply_date": "Monday, September 25, 2023 at 09:03:38 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "What went wrong with this was I was… unable to get cash back while depositing phones into my account",
        "commentaire": "What went wrong with this was I was trying to deposit a check and to my account I needed to get a portion of it back. Was denied because apparently it’s a new account and my check would have to be held for seven days before the funds were available. This does not work for me, I live on a limited income and have bills to pay. It’s been almost 2 weeks since I opened my account. I still have not received a debit card which is why I was requesting cash back from the phones I was depositing I also use Venmo quite often, yet , I discovered after opening the account that liberty first does not allow you to use Venmo. A lot of people use Venmo these days. It would really make it helpful to folks if they were still able to use this app. I get money and I send money through Venmo a lot .",
        "nombre_reviews": 1,
        "date_experience": "April 23, 2024",
        "reply": null
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Came in to open a new account and open…",
        "commentaire": "Came in to open a new account and open a CD. Everything went quick and smooth.",
        "nombre_reviews": 1,
        "date_experience": "May 17, 2024",
        "reply": {
            "reply_text": "Thank you, Larry. We are glad you had a good experience and are happy you are a member!",
            "reply_date": "Wednesday, May 29, 2024 at 12:36:33 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I called to inquire about a car loan…",
        "commentaire": "I called to inquire about a car loan and Mellie walked me through the process. I went to the branch to sign paperwork that was waiting for me when I walked in the door. Mellie called a few days later to follow up to see where I was in the purchasing process. She has been kind and helpful and answered all of my questions, even when I asked them two or three times.",
        "nombre_reviews": 1,
        "date_experience": "March 30, 2024",
        "reply": {
            "reply_text": "Carol, we are so glad that Nellie was able to help you and that you had a great experience!",
            "reply_date": "Wednesday, April 17, 2024 at 12:29:19 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Friendly and informed me on each step",
        "commentaire": "Friendly and informed me on each step . Front staff were very helpful with starting my account.",
        "nombre_reviews": 1,
        "date_experience": "April 27, 2024",
        "reply": {
            "reply_text": "Thank you, we are so glad you had a great experience and are happy to have you as a member!",
            "reply_date": "Friday, May 10, 2024 at 12:32:49 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Exceptional!",
        "commentaire": "Joe Evans was amazing at getting my car loan done in an exceptional timely manner! I plan on transferring all my banking to Liberty First!",
        "nombre_reviews": 1,
        "date_experience": "March 16, 2024",
        "reply": {
            "reply_text": "We are so glad you had a great experience, and that Joe was able to get it done in a timely manner.",
            "reply_date": "Wednesday, April 3, 2024 at 12:28:30 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Brian Crawford was super helpful & fun…",
        "commentaire": "Brian Crawford was super helpful & fun to work with & you had a very attractive rate for the term we needed.",
        "nombre_reviews": 1,
        "date_experience": "April 05, 2024",
        "reply": {
            "reply_text": "We are so glad that Brian could help you. Thanks for being a member of Liberty First.",
            "reply_date": "Monday, April 15, 2024 at 04:49:59 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Auto Loan Refinance",
        "commentaire": "I was looking for better terms for my auto loan. Shawna was very helpful and knowledgeable to assist me in getting this done. She made the entire process seamless, with a couple of emails, confidential phone call and in-person closing meeting to sign papers. Very pleased to have much better terms and repayment options in my new loan. Great customer service! Thanks again -TJ",
        "nombre_reviews": 1,
        "date_experience": "November 09, 2023",
        "reply": {
            "reply_text": "TJ, we are so glad that Shawna was able to assist you and make the process easy. We are happy to have you as a member!",
            "reply_date": "Monday, November 20, 2023 at 09:10:32 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Initial meeting",
        "commentaire": "I appreciated the detail the banker used to explain opening an account. I felt heard and understood. I felt like we were talking about \"my money\", not the banks involvement. As an older individual I need to feel trust in the persons I choose to assist me.",
        "nombre_reviews": 1,
        "date_experience": "December 13, 2023",
        "reply": {
            "reply_text": "We are so glad that you choose Liberty First, thank you for being a member!",
            "reply_date": "Tuesday, January 2, 2024 at 02:03:32 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great people!",
        "commentaire": "I really loved working with Rhianna Maloney. She is very kind, took time to explain things to me, (I have a lot of dumb questions) and was just overall wonderful to work with. I have recommended her & Liberty First to 2 of my friends now!",
        "nombre_reviews": 1,
        "date_experience": "February 10, 2024",
        "reply": {
            "reply_text": "Emily, we are so happy that you had a great experience with Rhianna. Welcome to Liberty First Credit Union!",
            "reply_date": "Tuesday, February 20, 2024 at 07:03:15 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Liberty First did a great job keeping…",
        "commentaire": "Liberty First did a great job keeping us informed and updated on the progress. Jason Bell is awesome to work with and truly cares about his clients.",
        "nombre_reviews": 1,
        "date_experience": "March 22, 2024",
        "reply": {
            "reply_text": "We are so glad that Jason could help you and that you had a great experience.",
            "reply_date": "Monday, April 1, 2024 at 04:30:56 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I am delighted to be a part of the Liberty Union family.",
        "commentaire": "Everyone I've met at the Branch has been exemplary in dealing with my queries and my business dealings. Service is fast, with no problems that I have encountered at a few banks in the past. CU's are the way to go, you become a part of a family.\nI'm delighted to be part of the Liberty Union family!",
        "nombre_reviews": 1,
        "date_experience": "January 04, 2024",
        "reply": {
            "reply_text": "We are so happy to have you as a member!",
            "reply_date": "Monday, January 22, 2024 at 01:29:50 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Susan Classen was amazing to work with",
        "commentaire": "Susan Classen was amazing to work with. She is so friendly and knowledgeable about what type of checking and saving account we should use. Because of her I have referred many friends and family to Liberty First Credit Union.",
        "nombre_reviews": 1,
        "date_experience": "December 14, 2023",
        "reply": {
            "reply_text": "Thank you, Jill! We are so glad Susan could help you.",
            "reply_date": "Tuesday, January 2, 2024 at 01:59:31 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I’d give liberty first 5 starts any day…",
        "commentaire": "I’d give liberty first 5 starts any day of the week! Everyone was super helpful and they made my first time loan experience fast and easy. I have and will recommend them to anyone I can",
        "nombre_reviews": 1,
        "date_experience": "March 07, 2024",
        "reply": {
            "reply_text": "Jason we are so happy to hear that you had a great experience. Thank you for being a member of Liberty First.",
            "reply_date": "Monday, March 25, 2024 at 04:47:35 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Super helpful and friendly employees",
        "commentaire": "Super helpful and friendly employees. They go above and beyond to help!",
        "nombre_reviews": 1,
        "date_experience": "April 15, 2024",
        "reply": {
            "reply_text": "Thank you, Natalie, we are glad you had a great experience.",
            "reply_date": "Tuesday, April 30, 2024 at 04:18:52 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Tyler was an absolute pleasure to work…",
        "commentaire": "Tyler was an absolute pleasure to work with we had a few bumps in the road and he was able to conquer them and be able to make the VA loan go through. At this point I'm very impressed with Tyler and his tenacity to get things done and closed",
        "nombre_reviews": 1,
        "date_experience": "January 24, 2024",
        "reply": {
            "reply_text": "We are so glad you had a great experience with Tyler! Thank you for being a member of Liberty First!",
            "reply_date": "Monday, February 5, 2024 at 01:35:37 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Brian reached out right after my call…",
        "commentaire": "Brian reached out right after my call for information on Saturday morning. Met with him on Monday. He explained so many points from credit reporting & helping my daughter trying to establish credit. Great service!",
        "nombre_reviews": 1,
        "date_experience": "August 10, 2023",
        "reply": {
            "reply_text": "We are so glad that Brian was able to help you! Thanks for being a member!",
            "reply_date": "Monday, August 28, 2023 at 07:31:18 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Very helpful and efficient.",
        "commentaire": "Thank you for your help in acquiring my car loan. It was/is a positive experience. Your loan officer was helpful and efficient.",
        "nombre_reviews": 1,
        "date_experience": "February 23, 2024",
        "reply": {
            "reply_text": "Thank you so much for being a member. We are glad you had a good experience, and we were able to assist with your car loan.",
            "reply_date": "Friday, March 29, 2024 at 04:22:19 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Just finding your CU by accident going…",
        "commentaire": "Just finding your CU by accident going to the voting place. I’m a previous CU employee from OnPoint Credit Union in Portland Oregon. I’ve been here 5 years starting January, and I didn’t qualify to join U of Nebraska Credit Union, so I’ve just banked at a local bank. I was excited when I found your building so I decided to join.",
        "nombre_reviews": 1,
        "date_experience": "November 30, 2022",
        "reply": {
            "reply_text": "We are so excited you found us and are thrilled to have you as a member of Liberty First!",
            "reply_date": "Monday, December 12, 2022 at 08:32:51 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Shawna T 🙌",
        "commentaire": "Shawna T. was awesome. She heard my needs, made suggestions that were more affordable, and once I committed to a car loan, in this case, she had a checklist of tasks I needed to follow through with to complete the sale. Then, she improved my credit further by offering me a fixed rate credit card with a great limit with an APR better than any other offers I’ve had (and there are constant offers). She made everything easy, she knew every detail, and she stayed longer hours so I could get there after work. Stellar.",
        "nombre_reviews": 1,
        "date_experience": "October 21, 2022",
        "reply": {
            "reply_text": "Thank you, we are so glad that Shawna could help you!",
            "reply_date": "Monday, November 14, 2022 at 01:48:49 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Liberty First is a better financial Institution",
        "commentaire": "Liberty First was highly recommended to me by a friend. I stopped by the Credit Union and was immediately greeted by a friendly teller. Megan took care of all my banking needs and provided over the top customer service. She is so knowledgeable about all banking services provided by Liberty First. I feel so relieved to have her services and can trust her advice.",
        "nombre_reviews": 1,
        "date_experience": "March 09, 2023",
        "reply": {
            "reply_text": "Anita, we are so happy that Megan could help you. Welcome to the credit union!",
            "reply_date": "Monday, March 20, 2023 at 05:48:26 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Easy to use",
        "commentaire": "Easy to use . I like that the app gives the kids missions to complete & learn about financial literacy at a young age and they can be rewarded for completing the missions by “US PATENTS “ by setting up how much they can make by completing each mission… it gives them a sense of how the real world works . My daughter loves being rewarded but she’s also learning about borrowing & investments at the same time . Brilliant!",
        "nombre_reviews": 1,
        "date_experience": "June 11, 2024",
        "reply": {
            "reply_text": "Hi Pinky, thank you for your 5* review! We are pleased to hear the GoHenry app works well for you and your daughter! It is great to hear she is participating in the Money Missions and learning all about money! - Abbie",
            "reply_date": "Friday, June 14, 2024 at 06:51:11 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "My son is loving it he had it before…",
        "commentaire": "My son is loving it he had it before and I canceled and bugged me until I got it again",
        "nombre_reviews": 1,
        "date_experience": "June 07, 2024",
        "reply": null
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "the glitches sealed the deal",
        "commentaire": "I like the service the app provides but I’m giving a low rating because there’s way too many glitches, I can’t even verify my email . I also can’t seem to contact anyone about receiving my child’s custom cards either. They were tracked to arrive 6/11/24 never showed and there’s no tracking information, where it previously said “will be with you by end of day” it now says nothing but activate card",
        "nombre_reviews": 1,
        "date_experience": "June 11, 2024",
        "reply": {
            "reply_text": "HI, I am sorry to hear that the custom card has not arrived. Please can I ask you to contact us on (877)372-6466 or email us at help@gohenrycard.com. We can then look into this for you straight away. Thank you! Debbie",
            "reply_date": "Sunday, June 16, 2024 at 07:12:12 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "This app give us so many clear options…",
        "commentaire": "This app give us so many clear options to teach our kids about money, while giving them the best experience in fiscal responsibility.",
        "nombre_reviews": 1,
        "date_experience": "June 15, 2024",
        "reply": {
            "reply_text": "Hi. Thank you for your 5* review! We are pleased to hear the GoHenry app works well for you. We are passionate about teaching children good money management. We believe this is a lifelong skill - Debbie",
            "reply_date": "Sunday, June 16, 2024 at 07:15:31 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "My nephew is in love with GOHenry!",
        "commentaire": "My nephew is growing his piggy bank and spending as he pleases, even though there was one hiccup when he tried to buy something and there wasn’t quite enough loaded onto his debit (only a few cents off, he was on a field trip and forgot that he had cash too, obviously not the app’s fault)!\n\nThe app alerted me about the “hiccup” and I adjusted his monthly payment accordingly. It’s been extremely exciting and useful. Thank you so much!",
        "nombre_reviews": 1,
        "date_experience": "June 02, 2024",
        "reply": {
            "reply_text": "Hi Holly, thank you so much for your 5* review. We're happy to hear you and your nephew are enjoying our service! - Emily",
            "reply_date": "Monday, June 3, 2024 at 07:11:21 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I really appreciate the lessons that…",
        "commentaire": "I really appreciate the lessons that are included for extra pay. Such a clever idea, and awesome way to incentivize the kids to learn.",
        "nombre_reviews": 1,
        "date_experience": "June 12, 2024",
        "reply": {
            "reply_text": "Hi, Rose, thank you for your lovely feedback! I'm glad to hear your child is finding the money lessons useful for their learning! - Melissa",
            "reply_date": "Thursday, June 13, 2024 at 08:21:46 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Terrible customer service and delay",
        "commentaire": "I established an account for my son in January 2024; we are in June 2024, and I'm still waiting for the debit card; I contacted customer service 4 times, but they always have a BS excuse.\n5 months and no card, 12 years old is for sure saving money!",
        "nombre_reviews": 1,
        "date_experience": "June 14, 2024",
        "reply": {
            "reply_text": "Hi Tristan,\n\nThank you for taking the time to speak with me today.\n\nIt is sad to hear that you were unable to receive the cards and unable to benefit from our services, even after a period of time. I understand how this may have been inconvenient for you and your child, and we at GoHenry apologize for any frustration caused by this. We appreciate that life can be busy, and that you did not get a chance to reach out any earlier.\n\nWe can confirm that our agents followed processes and did all in our power to get cards to you and your child, and it is lamentable to hear that these still did not arrive your side, despite our efforts.\n\nWe hope that you and your family find a service that works for you moving forwards.\n\nMany thanks,\nSally\nGohenry Supervisor",
            "reply_date": "Monday, June 17, 2024 at 06:50:24 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great app for teaching kids how to…",
        "commentaire": "Great app for teaching kids how to manage their money. I love the lessons and tasks within the app.",
        "nombre_reviews": 1,
        "date_experience": "June 18, 2024",
        "reply": {
            "reply_text": "Hi LaVonna, thank you so much for your 5* review! We are so pleased to hear that you are utilising GoHenry to help teach the basics of money management! - Hayley",
            "reply_date": "Wednesday, June 19, 2024 at 07:45:55 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "good way to teach kids about money",
        "commentaire": "I think it's a good why to teach kids about money money, especially with the lessons",
        "nombre_reviews": 1,
        "date_experience": "June 17, 2024",
        "reply": {
            "reply_text": "Hi Amerie, Thank you for sharing your fantastic review of our service! We are so grateful to hear you are loving GoHenry and our educational money missions! - Hayley",
            "reply_date": "Wednesday, June 19, 2024 at 07:45:16 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "GoHenry is for Teaching financial skills",
        "commentaire": "GoHenry is easy to use. I never have any issues with the app. It’s always running properly. I’m always able to transfer the money with no problem and send it to my daughter and I love the parental controls.",
        "nombre_reviews": 1,
        "date_experience": "June 06, 2024",
        "reply": {
            "reply_text": "Hi Nadia, thank you for your 5* review! It is great to hear the GoHenry app is working so well for you and your family - Abbie",
            "reply_date": "Friday, June 7, 2024 at 06:47:15 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "HORRIBLE customer service",
        "commentaire": "HORRIBLE customer service! My child's card was supposed to arrive on the scheduled day. It didn't, no problem I'll call. Phones are closed for THREE business days! Email response 3-5 business days. For a LOST CARD! This is my first and LAST experience with them. ZERO response. I have reported them to BBB. AWFUL.",
        "nombre_reviews": 1,
        "date_experience": "June 10, 2024",
        "reply": {
            "reply_text": "Hi April,\n\nWe have acknowledged your contact with us and have confirmed there has been a technical issue with the processing of your son's card. We are hoping to speak to you today directly to apologise (see case ref 04104110 email response).\n\nWe have a biannual company-wide event that has limited our availability over the last 3 days which we notified our members about.\n\nWe are available today on phones and chat from 9am EST.\n\nThanks\n\nRoisin",
            "reply_date": "Friday, June 14, 2024 at 08:20:43 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Kids are loving it",
        "commentaire": "Kids are loving wanting extra chores and they can buy online gifts on there own.",
        "nombre_reviews": 1,
        "date_experience": "June 13, 2024",
        "reply": {
            "reply_text": "Hi, Carol, thank you for your 5* review! We're glad to hear that your family is enjoying using GoHenry. - Melissa",
            "reply_date": "Thursday, June 13, 2024 at 03:46:49 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "GoHenry got my vote in a head to head comparison",
        "commentaire": "Signed up at same time I tried a competitor. GoHenry was seamless and painless, whereas I had to make 3 phone calls and numerous emails to the other company. Product works. No issues. My son loves it and is learning about finances at the same time.",
        "nombre_reviews": 1,
        "date_experience": "May 18, 2024",
        "reply": {
            "reply_text": "Hi there, thank you for your 5* review. It's lovely to hear you are enjoying the features we offer! - Emily",
            "reply_date": "Monday, June 3, 2024 at 07:12:07 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Worst Experience - Lost card/wouldn’t refund my money",
        "commentaire": "Custom card that I paid $5 for never came. The agents were not helpful in they just gave old me to keep waiting. I had to actively ask for a refund as well as a free card. I have $125 loaded into the inactivated card and they would not give it back to me. I have to go and email and send bank information over email. It’s very inconvenient and suspicious. Not a good experience AT ALL.",
        "nombre_reviews": 1,
        "date_experience": "June 11, 2024",
        "reply": {
            "reply_text": "Hi Gabriella,\n\nThank you for taking the time to leave us your review. I have located your account and tried to call however it looks like the call disconnected.\n\nIt is disheartening to hear that you hadn't received the child's card as Pokemon was a limited edition card design and was no longer available to order when you contacted. The agent had added a free custom card promo to your account so that another custom card design can be ordered free of charge.\n\nOn occasion, we are unable to process a debit card refund due to the following reasons: your stored card has expired, the refund amount is higher than your loaded amount (we can only refund an individual top-up of the same value or across 3 individual loads only), your stored debit card has not been used within the last three months or the stored debit card is not in your name. Therefore, we would need your ACH details to process a refund of the funds in your account.\n\nI have sent you an email to your registered email address. Please may you review the email at your earliest convenience, you are welcome to reply to the email or give us a call at 877 372 6466. We are open 9 am - 5 pm EST, 7 days a week.\n\nThanks,\n\nSuvechha - GoHenry Supervisor",
            "reply_date": "Monday, June 17, 2024 at 06:50:07 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great app",
        "commentaire": "Used to use Copper before they shut down the deposit accounts. I wish I switched earlier. This app is great and so user friendly.",
        "nombre_reviews": 1,
        "date_experience": "June 11, 2024",
        "reply": {
            "reply_text": "Hi Sanni! Thanks for your 5-star review! We are so pleased to hear that you find GoHenry user-friendly. - Naomi 😊",
            "reply_date": "Wednesday, June 12, 2024 at 07:12:33 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "My kids love the debit cards to spend…",
        "commentaire": "My kids love the debit cards to spend their chore money! It’s the easiest way to keep track of my kids spending and help them learn the value of money",
        "nombre_reviews": 1,
        "date_experience": "June 12, 2024",
        "reply": {
            "reply_text": "Hi Kristin! Thanks for the lovely 5-star review! We're so happy to hear that you and your family are enjoying using the GoHenry app! - Naomi 😊",
            "reply_date": "Wednesday, June 12, 2024 at 02:50:54 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Payments and Savings are Simple!",
        "commentaire": "GoHenry makes it simple to pay my son his allowance each week. It teaches him how to save and spend responsibly. He loves having a debit card with his name and favorite animal on it. The cost is well worth it!",
        "nombre_reviews": 1,
        "date_experience": "May 30, 2023",
        "reply": {
            "reply_text": "Hi Michelle, thank you for your 5* review. It's amazing to hear you are enjoying all the features we have to offer! - Emily",
            "reply_date": "Thursday, May 30, 2024 at 06:57:03 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Excited",
        "commentaire": "So so good so much to do on app I can’t wait to get cards and my kids start Earning money and being able to use when they are out with family and friends",
        "nombre_reviews": 1,
        "date_experience": "May 24, 2024",
        "reply": {
            "reply_text": "Hi K Otpi, thank you for 5 stars. We appreciate the kind feedback you have left us! Thanks, Sophie 🙂",
            "reply_date": "Wednesday, May 29, 2024 at 06:51:03 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "This has been an amazing tool",
        "commentaire": "This has been an amazing tool. I got this for my son for a way to track his chores and see what he was earning his allowance for. The added benefit is other family member can easily transfer money to him for special occasions or just because.",
        "nombre_reviews": 1,
        "date_experience": "May 18, 2024",
        "reply": {
            "reply_text": "Hi Heather, thank you for this lovely 5* review! We are so happy that you and your son enjoy our service! Thanks. -Delia😊",
            "reply_date": "Saturday, May 18, 2024 at 08:32:45 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Wonderful",
        "commentaire": "Simply grea! Excellent way to teach kids frugality and savings early enough. User friendly app and my son loves the confidence of having control over his money with parental oversight. Finally, the card helped me the parent.",
        "nombre_reviews": 1,
        "date_experience": "April 26, 2024",
        "reply": {
            "reply_text": "Hi Zakari, thank you for this positive feedback! We are so pleased to hear this. - Inaaya 😊",
            "reply_date": "Sunday, May 12, 2024 at 07:08:52 AM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "They truly delivered",
        "commentaire": "They truly delivered! Sign up, pass KYC, deposit $20 and receive your free $25! They say BTC but you get usd that you HAVE to turn into btc at a cost. So that’s a bit disappointing but safe way to buy and send btc if you are a beginner!",
        "nombre_reviews": 9,
        "date_experience": "June 07, 2024",
        "reply": {
            "reply_text": "Dear Creasie,\n\nThank you for taking the time to share your experience with Crypto Dispensers. We are delighted to hear that we delivered on our promise of a straightforward signup and deposit process, and that you were able to take advantage of the bonus offer.\n\nWe appreciate your candid feedback regarding the mechanics of converting the USD bonus into BTC. We aim to be transparent about any associated costs and understand how crucial it is for our users to feel fully informed and satisfied with every aspect of our service. Your insights are invaluable, as they help us refine our offerings to better meet the needs of all our customers.\n\nIt’s great to hear that you found our platform a safe way to buy and send Bitcoin, especially for beginners. At Crypto Dispensers, we strive to make the cryptocurrency buying process as accessible and secure as possible, ensuring that even those new to the field can navigate with confidence.\n\nThank you once again for choosing Crypto Dispensers and for your constructive comments. We are committed to continuous improvement and are here to support your ongoing journey in the world of cryptocurrency. If there's anything more we can do to enhance your experience, please let us know.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, June 12, 2024 at 02:37:33 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "First time",
        "commentaire": "I have never purchased crypto currency before and was uneasy about the process. However, the kiosk was very user friendly and I was able to deposit the cash easily. It appeared in my crypto wallet almost immediately. The experience definitely eased my worries and I will use it again.",
        "nombre_reviews": 9,
        "date_experience": "May 25, 2024",
        "reply": {
            "reply_text": "Dear Jeff,\n\nThank you for sharing your first cryptocurrency purchase experience with us! We're delighted to hear that our kiosk was user-friendly and that the process of depositing cash and seeing it appear in your wallet almost immediately was smooth and reassuring.\n\nAt Crypto Dispensers, we understand that venturing into the world of cryptocurrency can be daunting for newcomers. That's why we've designed our services to be as accessible and intuitive as possible. Hearing that your initial apprehensions were eased and that you are now more confident about using our services again in the future is exactly what we strive to achieve.\n\nWe're committed to continuing to provide a seamless and supportive experience to help you and all our users navigate the exciting possibilities in cryptocurrency. Whether you're making future deposits or need any assistance along the way, our team is here to ensure your journey is as smooth and enjoyable as possible.\n\nThank you once again for choosing Crypto Dispensers and for your willingness to use our services again. We look forward to supporting your next transactions and are here to help with any questions or further needs you might have.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Monday, May 27, 2024 at 01:16:02 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "MX",
        "Titre": "great overall crypto merchant to…",
        "commentaire": "great overall crypto merchant to purchase from!",
        "nombre_reviews": 9,
        "date_experience": "June 10, 2024",
        "reply": {
            "reply_text": "Dear Evan,\n\nThank you for your kind words and for taking the time to share your experience with Crypto Dispensers. We're delighted to hear that you consider us a great crypto merchant to purchase from. Your satisfaction is our top priority, and we're thrilled to meet your expectations.\n\nAt Crypto Dispensers, we strive to provide a reliable and user-friendly platform that makes purchasing cryptocurrency straightforward and secure for everyone. It’s gratifying to know that our efforts are resonating with our users.\n\nWe're committed to continuing to provide excellent service and are always looking for ways to improve. If you have any suggestions or need further assistance, please don't hesitate to reach out. We value your feedback and are here to support you at every step of your cryptocurrency journey.\n\nThank you once again for choosing Crypto Dispensers, and we look forward to serving you again soon!\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, June 12, 2024 at 02:01:18 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "So far so good with this platform",
        "commentaire": "So far so good with this platform. I have yet to make a deposit or withdrawal but I see they offer a few different deposit methods and many different locations.\n\nThey offer a bonus when you sign up and make a deposit. So far only btc is offered on this site which would be my one complaint so far. I'm sure they will eventually expand to other different coins.\n\n\nUpdate:\nI was told I would get a $25 bonus after my first transaction. Its been 2 weeks a no bonus and no response from support. I was also told I would get a $10 if I left a 5 star review. Don't see that either.",
        "nombre_reviews": 9,
        "date_experience": "May 24, 2024",
        "reply": {
            "reply_text": "Dear Anthony,\n\nThank you so much for taking the time to leave us a review and for sharing your initial impressions of Crypto Dispensers. We are thrilled to hear that your experience with our platform has been positive so far. Your feedback is incredibly valuable to us as it helps us continue to improve and tailor our services to meet the needs of our users.\n\nWe're glad you appreciate the variety of deposit methods and the extensive network of locations we offer. These features are designed to make the process of buying Bitcoin as convenient and accessible as possible. We also hope you take advantage of the signup bonus when you make your first deposit—it's one of the ways we like to welcome new members to the Crypto Dispensers family.\n\nRegarding your feedback about currently only offering Bitcoin, we hear you! Expanding our offerings to include more cryptocurrencies is definitely on our roadmap. We are continuously working to add more options to meet the diverse needs and interests of our users. Your input is a helpful reminder of how important this is for our community.\n\nThank you once again for choosing Crypto Dispensers and for your constructive feedback. We look forward to growing with you and hope to continue meeting your expectations. If you have any questions or need assistance as you start making deposits and withdrawals, our customer support team is here to help every step of the way.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Saturday, May 25, 2024 at 11:58:09 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Look NO futher than",
        "commentaire": "If you are looking for a company that is reliable at its core? and dedicated to helping its customers? Do you want to have a timley response to all your questions? then look no further than Crypto Dispensers! These guys are better then coinbase in my opinion! The staff is so smart and patient on top of being sweet as can be!",
        "nombre_reviews": 9,
        "date_experience": "May 24, 2024",
        "reply": {
            "reply_text": "Dear Andy,\n\nThank you for your enthusiastic review and for recommending Crypto Dispensers so highly! We are truly honored by your comparison and delighted to hear that you hold our platform in such high regard, especially when placed alongside industry giants like Coinbase.\n\nAt Crypto Dispensers, we strive to be a company that is not only reliable but also deeply committed to the satisfaction and success of our users. It's wonderful to know that our team's dedication and timely responses have made a significant positive impact on your experience.\n\nWe take great pride in the professionalism, patience, and kindness of our staff, and your acknowledgment of these qualities is incredibly affirming for all of us. We believe that our customer service should not only meet but exceed expectations at every turn, providing a supportive and friendly environment for everyone navigating the crypto space.\n\nThank you once again for choosing Crypto Dispensers and for your trust in our services. Your feedback is invaluable as it encourages us to continue improving and delivering the best possible experience to our community. We look forward to supporting your ongoing cryptocurrency journey and remain committed to being your trusted partner in all things crypto.\n\nIf there’s anything more we can do to assist you or enhance your experience further, please do not hesitate to reach out. We’re here to help and ensure that your interactions with us are nothing short of excellent.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Saturday, May 25, 2024 at 11:59:14 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Simple, convenient, and great service!",
        "commentaire": "Crypto Dispensers is fairly simple and a convenient way to purchase cryptocurrency, especially if you are new to crypto and want to get started asap. One of the best features they have is being able to turn physical cash into readily available funds in your account that can be used to buy Bitcoin! I also would like to mention that when I was inconveniently blocked from being able to access my account, crypto dispensers helped me obtain access to my account again w/o hesitation! I am extremely grateful to their service and plan to use them in the near future, as well as refer my friends.",
        "nombre_reviews": 9,
        "date_experience": "March 13, 2024",
        "reply": {
            "reply_text": "Dear Jacob,\n\nThank you so much for your enthusiastic review of Crypto Dispensers! We are thrilled to hear that you found our platform simple, convenient, and service-oriented. It’s great to know that our efforts to make cryptocurrency accessible, especially for newcomers, are resonating with our users.\n\nYour appreciation for the feature that allows you to turn physical cash into funds in your account for purchasing Bitcoin highlights one of the key benefits we strive to offer. This functionality is designed to bridge the gap between traditional and digital finance, making the world of cryptocurrency more accessible to everyone.\n\nWe're also pleased to learn about your positive experience with our customer support team during the time you were blocked from accessing your account. We understand how critical it is to have reliable support in such situations, and we're glad we could assist you without hesitation.\n\nYour plans to continue using our services and to refer friends are the highest compliments we could receive. Referrals from satisfied customers like you help us grow and improve, ensuring we can continue to provide excellent service to the community.\n\nThank you once again for choosing Crypto Dispensers and for taking the time to share your positive experience. We look forward to serving you and your friends in the future, and we are here to support your cryptocurrency journey every step of the way.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, May 8, 2024 at 04:46:14 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "A great new option to purchase my Crypto",
        "commentaire": "I was driving home earlier today searching for a Bitcoin ATM and somehow I found a link for CryptoDispensers. It sounded like it possibly was too good to be true. They were offering $25 worth of free Bitcoin on your first deposit of $20 USD or more. With that information, I immediately opened an account with them. Went through the usual KYC (Know Your Customer), and before I knew it, I was at my closest CVS, making my first deposit of $250. I immediately received an email that the funds were in my account. I will definitely be using Crypto Dispensers from now on.",
        "nombre_reviews": 9,
        "date_experience": "March 13, 2024",
        "reply": {
            "reply_text": "Dear Corey Persky,\n\nYour review has truly brightened our day! We're thrilled to hear about your positive experience discovering and using Crypto Dispensers for the first time. Welcome to our community, and thank you for sharing your journey with us and others considering taking the leap into the world of cryptocurrency.\n\nFinding us while searching for a Bitcoin ATM and deciding to give our platform a try is a story we're excited to be a part of. We understand the hesitance that can come with trying something new, especially when it sounds too good to be true. That's why we're committed to transparency and providing real value to our users, including our $25 worth of free Bitcoin offer for first deposits of $20 USD or more. It's wonderful to know that this offer played a significant role in your decision to join us.\n\nWe're delighted that your initial deposit at CVS was not only successful but also efficiently added to your account, reflecting the seamless and user-friendly experience we strive to provide. Our goal is to make purchasing crypto as straightforward and accessible as possible, and it sounds like we were able to achieve that for you.\n\nHearing that you plan to continue using Crypto Dispensers is the best feedback we could ask for. We're here to support your crypto journey every step of the way, from making deposits at convenient locations like CVS to exploring new ways to engage with digital currencies.\n\nThank you once again for choosing Crypto Dispensers and for taking the time to share your experience. Your trust in us is greatly appreciated, and we're excited to have you as part of our growing community. We look forward to being your go-to platform for all your cryptocurrency needs.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Thursday, March 21, 2024 at 02:14:20 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Good customer service and secure…",
        "commentaire": "Good customer service and secure network for all my needs thanks I appreciate you guys keep up the good work 👍",
        "nombre_reviews": 9,
        "date_experience": "May 17, 2024",
        "reply": {
            "reply_text": "Dear Bj Kent,\n\nWe're incredibly grateful for your five-star review and thrilled to hear that you're satisfied with the customer service and security at Crypto Dispensers. Your acknowledgment of our efforts to maintain a secure and efficient network means a great deal to us.\n\nAt Crypto Dispensers, we prioritize providing a safe and user-friendly platform that meets all our users' needs, and we're delighted to know that our services have lived up to your expectations. We understand how crucial both security and customer service are in the world of cryptocurrency, and we're committed to continuously enhancing these aspects to ensure the best possible experience for everyone.\n\nThank you for appreciating our work and encouraging us to keep up the good efforts. Positive feedback like yours not only motivates our team but also reaffirms our commitment to excellence in serving our community.\n\nWe look forward to continuing to support your cryptocurrency journey and are here for any needs or questions you might have in the future.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Friday, May 17, 2024 at 08:28:13 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "i have one suggestion",
        "commentaire": "i have one suggestion, you should also accept 3rd party credit card for payments as well.\nsince some time, 3rd party can not be avtive in systems them self or for any other reasons.",
        "nombre_reviews": 9,
        "date_experience": "March 18, 2024",
        "reply": {
            "reply_text": "Dear Mohammad Jamal,\n\nThank you for taking the time to share your suggestion with us. We're always looking for ways to enhance our platform and make our services more accessible to our users. Hearing directly from our community is invaluable in this endeavor, and we truly appreciate your feedback.\n\nRegarding the acceptance of third-party credit cards for payments, we understand the convenience and flexibility this could offer. However, our commitment to security and compliance necessitates stringent measures to protect our users from potential fraud and misuse. Accepting third-party credit cards presents significant risks that could compromise the integrity of transactions and the safety of our community.\n\nWe strive to balance accessibility with the highest security standards, ensuring that every transaction on our platform is both safe and compliant with regulatory requirements. This commitment sometimes means we must limit certain payment methods, but please know that these decisions are made with our users' best interests at heart.\n\nWe are continuously exploring new and secure payment options that align with our safety and compliance standards. Our goal is to offer a variety of payment methods that cater to our users' needs while maintaining the security and integrity of our platform.\n\nMohammad, your engagement and willingness to offer suggestions are what help us grow and improve. We're grateful for your support and understanding as we navigate these complex issues. Please keep the feedback coming, and know that we're here to provide assistance and answer any questions you may have.\n\nThank you again for choosing Crypto Dispensers and for being a valued member of our community. We look forward to continuing to serve you with the high standards of safety and convenience you expect from us.\n\nWarm regards,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Thursday, March 21, 2024 at 02:15:23 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great customer service",
        "commentaire": "Great customer service. They give great reward for first time users. Looking forward to watching my $$ grow!",
        "nombre_reviews": 9,
        "date_experience": "May 04, 2024",
        "reply": {
            "reply_text": "Dear Frankie,\n\nThank you so much for your wonderful review and for highlighting the excellent customer service and rewarding experience you've had with Crypto Dispensers. We are thrilled to hear that you are satisfied with the rewards for first-time users and are looking forward to your financial growth with us.\n\nAt Crypto Dispensers, we are committed to providing not just superior customer service but also an environment where our users can feel confident about their cryptocurrency investments. Your feedback reaffirms our commitment to delivering quality service and value to all our customers.\n\nWe are excited that you've chosen us to embark on your cryptocurrency journey, and we are just as eager to see your investments flourish. Remember, we are here to support you every step of the way, whether you have questions about your account or need insights into new opportunities within the crypto market.\n\nThank you once again for your trust and for sharing your positive experience. We look forward to continuing to serve you and to helping you watch your $$ grow. Your success is our success, and we are excited about what the future holds for you and all our Crypto Dispensers community members.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Monday, May 6, 2024 at 01:11:24 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "TH",
        "Titre": "DON’T FALL FOR THIS!!!!",
        "commentaire": "DON’T FALL FOR THIS!!!!\n\nFake platform. They will not help you buy cryptocurrencies. They will only ask you to provide all kinds of weird documents after receiving your wire transfer funds. Then they will hold your funds. Note that they will first give you about one-third of your funds in cryptocurrencies. Then they will hold your funds for up to several weeks. They held my funds for more than 30 working days for this reason. And they did not give me any compensation. Then when you ask them for a refund, they will tell you that the refund will take 60 days to complete. I have already reported this agency to the financial regulator.\n\n-------------------------------------------------------------\nI am glad to see that you responded to my message here in time. Because you still did not reply to my email after receiving all my documents. And you refused to communicate with me by phone. So today I reported the situation to the authorities. So far I have received $40,000 in cryptocurrency. You still owe me $160,000. Please send my cryptocurrency as soon as possible. You have illegally held these funds for more than 72 hours. If I cannot receive all the funds today. I will continue to report this situation to the authorities.\n\n----------------------------------------------------------------\nThis scam platform still holds over $100,000 of my funds and has not given me any crypto. They are preparing to give me money. I have already given them the money 5 days ago. It is obvious that they will use our money to do a lot of illegal things. They promised to give me all the funds today. Let's wait and see. I would never recommend anyone to use this platform to buy crypto. It is a stupid move.\n------------------------------------------------------------\nThree more days have passed. They have held my funds of about $100,000 without sending me any cryptocurrency. According to the agreement they gave me, the funds should have arrived in my account an hour ago. Whenever I ask about the funds, they will tell me that they are preparing the cryptocurrency. It has been prepared for about 10 days. It is an obvious fraud. I hope no one will be fooled.",
        "nombre_reviews": 9,
        "date_experience": "May 24, 2024",
        "reply": {
            "reply_text": "Dear Luna,\n\nThank you for taking the time to share your concerns. We take such feedback very seriously, and we want to address the issues you’ve raised promptly and transparently.\n\nUpon reviewing our records, we cannot find any transactions or interactions under your name that match the details you described. At Crypto Dispensers, we pride ourselves on providing a legitimate and transparent service, and what you’ve described does not align with our operational procedures. We never hold funds without clear, communicated reasons typically related to compliance with regulatory requirements, and we always aim to resolve any issues as swiftly as possible.\n\nIt sounds like there may have been a misunderstanding or a case of mistaken identity with another platform. We are eager to clarify this situation and ensure that your experience, whether directly or indirectly related to our services, is addressed.\n\nPlease reach out to us directly at help@cryptodispensers.com with any details of the transaction you refer to, and we will investigate this matter thoroughly. Our dedicated customer support team is ready to assist you and provide the necessary support to resolve any issues.\n\nWe are committed to ensuring that all users of Crypto Dispensers have a positive and seamless experience, and if there's been any confusion or error, we want to rectify it immediately.\n\nThank you once again for your feedback, and we look forward to hearing from you to help clarify and resolve any outstanding concerns.\n\nWarm regards,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Friday, May 24, 2024 at 08:55:06 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Great Customer Service and easy website",
        "commentaire": "Their website is very easy to use and purchases of coin goes very smoothly. Rather than dealing with these a big crypto sites that make it sound like they have it all together but offer no phone number and it takes forever to hear back with problems (I've dealt with many) - I'll take Crypto Dispensers anytime because even the owner, is hands on if there's any issues. Not only do they offer email from my account but also have a Customer Service phone number answered by a real HUMAN! I have run into an issue or two but their Customer Service is very responsive and is on it, resolving the problem right away. I suggest you give them a try because they are so good that you'll never consider buying coin anyplace other than Crypto Dispensers! These people really care about their customers!",
        "nombre_reviews": 9,
        "date_experience": "February 18, 2024",
        "reply": {
            "reply_text": "Dear Patricia,\n\nWe are immensely grateful for your glowing review and the time you've taken to share your experience with Crypto Dispensers. Hearing that you found our website user-friendly and our coin purchase process smooth fills us with pride and joy.\n\nYour comparison with larger crypto platforms and recognition of our unique approach to customer service truly highlights what we aim to achieve - a personalized, accessible, and responsive service for every user. We believe that being available and responsive to our users' needs sets us apart in the bustling world of cryptocurrency.\n\nWe're particularly touched by your appreciation for our hands-on approach, including the involvement of our owner in resolving any issues. Our commitment to providing real human customer service, be it through phone support or email, stems from our core belief that every user deserves to feel supported and valued.\n\nYour experiences, especially in overcoming the few issues encountered, underscore our dedication to resolving problems promptly and efficiently. We're here not just to offer a platform for buying coins but to ensure that each interaction with us is positive, supportive, and satisfactory.\n\nWe're honored by your recommendation and thrilled that you consider Crypto Dispensers as your go-to place for buying coins. Your endorsement means the world to us and motivates us to maintain and exceed the high standards we've set.\n\nPlease know that we are here for you, always ready to assist, support, and grow together in this exciting crypto journey. Your satisfaction and trust in us are what drive us to keep improving every day.\n\nThank you once again for choosing Crypto Dispensers and for being such a valued member of our community. We look forward to continuing to serve you and to always being your preferred choice for all things crypto.\n\nWarmest regards and deepest gratitude,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, March 5, 2024 at 07:51:15 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I good platform to use to buy bitcoin with!",
        "commentaire": "It took a while but I got my account unlocked and am happy because I like this company is easy to use to add money and buy Bitcoin.",
        "nombre_reviews": 9,
        "date_experience": "April 17, 2024",
        "reply": {
            "reply_text": "Dear Customer,\n\nThank you for sharing your experience with Crypto Dispensers. We're delighted to hear that you find our platform a good choice for buying Bitcoin and appreciate your patience and understanding while we worked to unlock your account.\n\nIt's great to know that you value the ease of adding money and purchasing Bitcoin through our platform. At Crypto Dispensers, we strive to make every aspect of the cryptocurrency transaction process as simple and user-friendly as possible. We understand the importance of having a reliable platform that not only meets but exceeds your expectations.\n\nWe apologize for any inconvenience you experienced during the account unlocking process. We are continuously working to enhance our security measures and customer support response times to ensure that such issues are resolved more swiftly in the future.\n\nThank you once again for choosing Crypto Dispensers and for your continued support. Your feedback is invaluable to us as it helps us improve and provide better services to our community. We look forward to serving you further and helping you with all your cryptocurrency needs.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, May 8, 2024 at 04:54:01 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Using Crypto Dispensers' CDReload…",
        "commentaire": "Using Crypto Dispensers' CDReload service has been a revelation for me. It's the perfect solution for buying Bitcoin with cash. I love the convenience of topping up my account at familiar retail stores like CVS Pharmacy, Rite Aid, Casey’s, and many more. Not only is the process incredibly user-friendly, but the rates are also notably more affordable than Bitcoin ATMs – almost half the cost! It genuinely feels like having a portable Bitcoin ATM right in the palm of my hand. If you're looking for a seamless, cost-effective way to delve into the world of cryptocurrency, CDReload is the way to go!",
        "nombre_reviews": 9,
        "date_experience": "October 21, 2023",
        "reply": {
            "reply_text": "Dear Wilson,\n\nA heartfelt thank you for taking a moment to share your positive experience with CDReload by Crypto Dispensers on this platform. Each review we receive, especially as comprehensive as yours, is a testament to our commitment and mission in bringing cryptocurrency closer to our community.\n\nIt's truly uplifting to hear that the convenience and affordability of our service resonated so well with you. From the very beginning, our vision has been to bridge the gap between the complex world of cryptocurrencies and everyday users. Offering a service that feels like having a \"portable Bitcoin ATM\" right at your fingertips is a realization of that dream, and we're glad you're reaping the benefits.\n\nYour comparison of our rates to Bitcoin ATMs and your appreciation of the seamless process echo what we aim to provide – a user-centric approach to cryptocurrency. Our collaborations with familiar retail chains, like CVS Pharmacy, Rite Aid, Casey’s, and more, are all driven by the motive of integrating cryptocurrency into familiar terrains for our users.\n\nIn a constantly evolving digital space, we understand the significance of trust and reliability. Your endorsement is a significant boost to our team, motivating us to push the boundaries further in service delivery and innovation.\n\nRemember, our journey together doesn’t stop here. If you've loved our platform, do consider sharing it with friends and acquaintances. Our referral program is crafted to ensure that when you bring others into our community, you too are aptly rewarded, aligning with our belief in collective growth.\n\nTo conclude, we'd like to express our gratitude for having you as a cherished member of the Crypto Dispensers community. We're not just here to facilitate transactions but to accompany you on your larger journey in the cryptocurrency realm.\n\nA massive thank you once again for your trust and your uplifting feedback. Here's to countless more fruitful exchanges in the future.\n\nWarmest regards,\nThe Crypto Dispensers Team",
            "reply_date": "Tuesday, October 31, 2023 at 03:49:58 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I found the website easy to use",
        "commentaire": "I found the website easy to use. Quick sign up process and works with any Bitcoin wallet. Referral bonus is awesome and I love how fast customer service responds if I have a question. I recommend for the new user!!!",
        "nombre_reviews": 9,
        "date_experience": "February 23, 2024",
        "reply": {
            "reply_text": "Dear Sam,\n\nWe are absolutely delighted with your five-star review and grateful that you took the time to share your experience with Crypto Dispensers. Hearing that you found our website easy to use, along with the quick sign-up process and compatibility with any Bitcoin wallet, truly warms our hearts.\n\nOur aim has always been to create an accessible and user-friendly platform that caters to the needs of both seasoned crypto enthusiasts and newcomers alike. It's rewarding to know that features like our referral bonus and the responsiveness of our customer service team have made a significant positive impact on your experience.\n\nYour recommendation, especially to new users, is the highest praise we could receive. It reinforces our commitment to providing a service that not only meets but exceeds the expectations of our community. We're here to support every user's journey into the world of cryptocurrency, making it as smooth and enjoyable as possible.\n\nPlease know that we're continuously working on enhancing our platform and services based on feedback from our valued users like you. Your satisfaction is our top priority, and we're always here to answer any questions and assist with any concerns you might have.\n\nThank you once again, Sam, for choosing Crypto Dispensers and for your enthusiastic recommendation. We're honored to have you as part of our community and look forward to continuing to serve you with excellence.\n\nWarm regards and deepest gratitude,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, March 5, 2024 at 08:19:36 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I've sent hundreds of phone calls and…",
        "commentaire": "I've sent hundreds of phone calls and emails ABSOLUTELY ZERO RESPONSE! THIS IS AN EMERGENCY AND I NEED MY MONEY! I am disgusted absolutely appalled that they don't answer anyone at all!\nI needd to send btc after depositing at cvs and over and over failed transaction! Please help!\n\n\n07/24/2023 UPDATE STILL NO WORD FORM ANYONE AND NO WAY TO FIX ISSIE. SCAMMED",
        "nombre_reviews": 9,
        "date_experience": "July 20, 2023",
        "reply": {
            "reply_text": "Dear Xavier,\n\nThank you for sharing your concerns with us on Trust Pilot. We deeply regret to hear about the difficulties you've encountered with our service. Please accept our sincerest apologies for the inconvenience you've had to go through.\n\nWe acknowledge that the lack of response to your numerous phone calls and emails is unacceptable and far from the high level of customer service we aim to provide. This is a crucial area for us to address and we assure you that we are treating this with the utmost seriousness.\n\nWith regard to the failed Bitcoin transaction following your deposit at CVS, we're pleased to inform you that you can now use your CDReload balance to purchase Bitcoin directly.\n\nIn light of your experience, we are committed to revisiting our customer service processes and improving communication with our valued customers. We assure you that Crypto Dispensers is not a scam and we deeply regret any impression that might have been\nconveyed.\n\nWe want to reassure you that your funds are safe and we're working diligently to resolve your issue. Your patience during this time is greatly appreciated and we hope to resolve this for you as soon as possible.\n\nOnce again, we apologize for the distress caused. If you have any further issues or queries, we encourage you to reach out to our dedicated customer service team who will be more than happy to assist you.",
            "reply_date": "Tuesday, July 25, 2023 at 03:16:22 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "This website is very problematic",
        "commentaire": "This website is very problematic. It's always working just fine until you deposit your money. A minute after my money is deposited into the account then an error message pops up saying they're having technical difficulties, which means you can't use your money for over 12 hours! If your website doesn't work, warn customers before they deposit. This has happened so much it seems like I'm being scammed out of my money. I send support tickets. No one ever responded to my concerns either.",
        "nombre_reviews": 9,
        "date_experience": "May 20, 2022",
        "reply": {
            "reply_text": "Dear Customer,\n\nThank you for your review. We are sorry to hear that you have had such a negative experience with our website. Our technical team is constantly working to improve the stability of our platform and we apologize for any inconvenience this may have caused you. If you would like to speak to someone about this issue, please feel free to contact our support team at any time. Thank you for your feedback and we hope that you will give us another chance in the future.",
            "reply_date": "Thursday, November 17, 2022 at 12:36:11 AM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Almost 5 Stars....",
        "commentaire": "I would have given a 5 Star review if it hadn't taken 9 days to get a Buy accomplished.\nI appreciate being responded to and kept informed as you worked through the banking issues.\nI hope it continues to be a good experience for us both.\nThe site is easy to use and the process is easy to follow.",
        "nombre_reviews": 9,
        "date_experience": "November 28, 2023",
        "reply": {
            "reply_text": "Dear Linda,\n\nThank you for taking the time to leave us a 4-star review. We're pleased to hear that you found our site user-friendly and the process straightforward. Your appreciation of our efforts to keep you informed during our recent banking issue means a lot to us.\n\nWe understand that the 9-day wait for your Buy transaction to be accomplished was less than ideal, and we sincerely apologize for any inconvenience this may have caused. Our goal at Crypto Dispensers is always to provide a seamless and efficient service, and we regret that we fell short of this in your case.\n\nYour experience has been invaluable in highlighting areas where we can improve. We are continuously working to enhance our processes to ensure faster and more reliable transactions for our customers. We're committed to making your experience with us a 5-star one in the future.\n\nWe’re grateful for your patience and understanding as we navigated through the banking challenges. It's heartening to know that our communication during this time was helpful to you. We aim to maintain this level of transparency and responsiveness as we move forward.\n\nThank you again for choosing Crypto Dispensers. We are encouraged by your hope for a continued good experience and are dedicated to making that a reality. We look forward to serving you better in your future interactions with us.\n\nWarm regards,\nCustomer Care Team, Crypto Dispensers",
            "reply_date": "Thursday, November 30, 2023 at 07:15:30 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I deposited $500 to my account and they…",
        "commentaire": "I deposited $500 to my account and they are not letting me withdraw my Bitcoin. Transaction id is vpAOK4. I will be posting about this daily until their site is offline or I get my Bitcoin.\n\nEdit: they replied to me saying their cash to crypto service was new, but they made this reply to someone else:\n\n\"We would like to assure you that we have been successfully operating as a reputable cash-to-cryptocurrency exchange since 2017. \"",
        "nombre_reviews": 9,
        "date_experience": "May 29, 2023",
        "reply": {
            "reply_text": "Dear John,\n\nWe are sincerely sorry to hear about the issues you've experienced with our service and for the inconvenience this has caused you. Your satisfaction is very important to us, and we deeply regret the problems you've had.\n\nWe were recently encountering technical difficulties that affected certain transactions, which could be the reason behind the difficulty you faced with your withdrawal. I am pleased to inform you that these technical issues have now been resolved.\n\nYou can go ahead and try processing your transaction with the ID vpAOK4 now. We trust it should proceed without any further issues.\n\nPlease understand that CDReload is a new service which we are constantly striving to improve every day. While we are working hard to ensure seamless transactions, there may be occasional bumps along the way, and we appreciate your patience and understanding during this period.\n\nWe apologize once again for the inconvenience and delay you had to experience. If you have any further issues or questions, please feel free to contact us. We're here to assist you and ensure your experience with us is satisfactory.\n\nBest Regards,\nThe Crypto Dispensers CDReload Customer Support Team",
            "reply_date": "Wednesday, May 31, 2023 at 07:17:34 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers  ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Well I deposited $7100 into their ATM …",
        "commentaire": "Well I deposited $7100 into their ATM got the receipt asked for a refund because the money never got to the wallet registered with my photo, driver license & phone # etc but the money never showed up into the wallet. So I asked for refunds 15x only received form letters from help@\nAnd now thinking sueing them because it appears they like others money more than earning it the hard way… they know me you should too\nNot a happy camper my wallet shows $0.00 balance and no actual reply’s.Note they do not answer calls @ crypto dispensers… good luck",
        "nombre_reviews": 9,
        "date_experience": "February 21, 2023",
        "reply": {
            "reply_text": "Dear Ronald,\n\nWe are sincerely sorry to hear about your experience, and we genuinely apologize for any inconvenience or distress you've faced. Please know that your concerns are important to us, and we want to ensure you receive the support and resolution you deserve.\n\nTo address your situation promptly and effectively, we kindly ask that you reach out to our dedicated support team at support@cryptodispensers.com or contact us directly at 888-212-5824. They are well-equipped to assist and provide clarity regarding your transaction.\n\nWe understand the importance of trust and reliability in our industry, and it's essential to us that all our customers feel heard and supported. Please give us an opportunity to address this matter and make it right.\n\nOnce again, we apologize for the delay in our response, and we are here to assist you further. Thank you for bringing this to our attention.\n\nWarm regards,\nThe Crypto Dispensers Team",
            "reply_date": "Saturday, September 16, 2023 at 02:43:30 PM"
        }
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "US",
        "Titre": "International transactions",
        "commentaire": "Very easy to do cross border transactions - thanks :)",
        "nombre_reviews": 2,
        "date_experience": "July 05, 2023",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "PK",
        "Titre": "Swadesh is a good app safely and truly…",
        "commentaire": "Swadesh is a good app safely and truly app this app is a expensive earning for you thanks.",
        "nombre_reviews": 2,
        "date_experience": "July 16, 2023",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "ET",
        "Titre": "Because",
        "commentaire": "I'm poor people help me",
        "nombre_reviews": 2,
        "date_experience": "August 10, 2023",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Cross border payments",
        "commentaire": "Transferred regular amounts from US to India for over a month, I did not face any major issues.",
        "nombre_reviews": 2,
        "date_experience": "November 09, 2022",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Cool Benefits",
        "commentaire": "Just downloaded the app to manage my expenses in the US but got a lot more benefits than what I expected.",
        "nombre_reviews": 2,
        "date_experience": "December 09, 2022",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Best banking app for Indian internationals",
        "commentaire": "It took my less than 15 minutes to download and get a US bank account! The customer support is really nice as well",
        "nombre_reviews": 2,
        "date_experience": "December 28, 2022",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Banking in the US",
        "commentaire": "Day to day transactions were much easier to manage with Swadesh.",
        "nombre_reviews": 2,
        "date_experience": "November 22, 2022",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Made for Indians in the US",
        "commentaire": "Best app for managing finances for students/ professionals in the US",
        "nombre_reviews": 2,
        "date_experience": "January 01, 2023",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Working experience is 4years",
        "commentaire": "Useful",
        "nombre_reviews": 2,
        "date_experience": "July 13, 2023",
        "reply": null
    },
    {
        "company_name": "Swadesh ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Swadeshi Feels",
        "commentaire": "Easy UI. Very helpful",
        "nombre_reviews": 2,
        "date_experience": "November 01, 2022",
        "reply": null
    },
    {
        "company_name": "The Payment HQ ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Best Merchant Ever",
        "commentaire": "Since day 1 Cesario has been our local rep and has been there every step of the way to help me whenever I needed. The Payment HQ is the best merchant services and most trustworthy company I have dealt with. They support my industry which is considered high risk and made it very easy to get me an account approved. Besides getting an account approved and processing without issue, they also had a large catalog of terminal and point of sale solutions to select from. The point-of-sale system Cesar recommended to invest in has helped save me countless hours of inventory management. You get great customer service and options to select what’s best for your business. I absolutely enjoy working with The Payment HQ and of course their best rep Cesario.\nThank you Cesario & The Payment HQ for supporting my business.\n\nAdam's Ave Smoke Shop",
        "nombre_reviews": 1,
        "date_experience": "October 09, 2023",
        "reply": {
            "reply_text": "Thank you Jay for sharing your positive experience working with us! Getting high risk account approved and processing seamlessly is our specialty. We are very happy to hear that you are loving your new point of sale system and that it has helped improve how you run your business. You are in good capable hands with Cesario and we look forward to being of service to you for many years to come!",
            "reply_date": "Thursday, October 19, 2023 at 09:40:53 PM"
        }
    },
    {
        "company_name": "The Payment HQ ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Payment HQ is the best Merchant…",
        "commentaire": "Payment HQ is the best Merchant Services out there!, not only are they local my rep Cesar always goes above and beyond to help my business with support (never switching). Even the supporting reps at Payment HQ are always willing help. The level of treatment and care I receive I can not even being to explain. I truly found a company that cares about my business needs and doesn’t treat me like a number. If you are needing or just looking for a new merchant you must to contact Payment HQ and ask for Cesar!",
        "nombre_reviews": 1,
        "date_experience": "January 02, 2023",
        "reply": {
            "reply_text": "Thank you for sharing your positive feedback! We strive to exceed our customers expectations with a high level of service and care when we are trusted to be your payments provider. Hearing from you let's us know that our training and vision is being honored with our team members.\n\nCesar is one of our top guys and you are in great hands working with him. We are glad to have you as a valued customer and look forward to supporting you in the years to come.\n\nThe Payment HQ Team",
            "reply_date": "Saturday, July 8, 2023 at 04:03:28 PM"
        }
    },
    {
        "company_name": "The Payment HQ ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I am lucky to work with The Payment HQ!",
        "commentaire": "I am lucky to have had an exceptional experience working with Charles and Giovanni at The Payment HQ. Their team provided top-notch expertise and professionalism throughout the entire process. The platform they offer is user-friendly and robust, delivering seamless and secure solutions. I greatly appreciate their prompt and reliable customer service, always there to assist with any inquiries. I highly recommend The Payment HQ.",
        "nombre_reviews": 1,
        "date_experience": "June 28, 2023",
        "reply": {
            "reply_text": "Hi Austin,\n\nWe appreciate you sharing your positive experience and letting us know our platform & team is delivering is delivering on its promises.\n\nIt's our goal to ensure our clients and partners have a world class experience working with us and our platform.\n\nWe look forward to being of service and thank you for your business relationship!\n\nThe Payment HQ Team",
            "reply_date": "Friday, June 30, 2023 at 04:09:19 PM"
        }
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Bank Trust.",
        "commentaire": "I needed a bank I could trust, with an actual physical location to interact with. Not spending countless hours on the phone just to try to get my money; and they were there when needed. It is great to know some banks still value customer interaction and face to face transactions. In the age when people pretend to be other people, Meriwest provides me ample security, safety, and peace of mind in knowing they can’t be defrauded putting my money in safe hands.",
        "nombre_reviews": 9,
        "date_experience": "December 13, 2023",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Horrible Customer Service",
        "commentaire": "I was an almost 30 year client of Meriwest until they upgraded their login system with minimal notification and locked my out of my account. After multiple attempts, I final sent a registered letter to close my account back in March, and have yet to get my money back (now May). They continue to send me e-notices even though I have told them multiple times I can't login (probably telling me about all the fees that they are charging me rather than giving my money back as requested). I suspect I am going to have to get a lawyer involved to get my money back from them.\n\nBottom line: I would bury my money in glass jars in the backyard before I would use Meriwest again. They certainly put profits ahead of customer satisfaction.",
        "nombre_reviews": 9,
        "date_experience": "May 20, 2023",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "If I could give a -10 I would",
        "commentaire": "If I could give a -10 I would. We have had IBM then Meriwest for over 50 years. The customer service is terrible. After waiting for 45 minutes last week and never getting the escalation callback, I had to wait another 45 minutes today. I cannot log into my on-line account. Their solution - come into a branch. Problem is the closest branch is an eight hour drive. RUN far away from them!",
        "nombre_reviews": 9,
        "date_experience": "March 11, 2022",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "As a client of Meriwest Credit Union",
        "commentaire": "As a client of Meriwest Credit Union, I am thoroughly impressed with their overall services. The staff is consistently engaging, professional, and ready to help, which makes for a very positive communication experience.\nTheir credit terms are transparent and easy to understand. This was particularly beneficial when I was looking to finance my automobile purchase. The terms were advantageous, offering great value and fitting well with my financial planning.\nIn summary, Meriwest Credit Union offers not only top-notch service, but also advantageous credit conditions. My experience financing my car through them was seamless and stress-free. I wholeheartedly recommend Meriwest for anyone in need of financial services.",
        "nombre_reviews": 9,
        "date_experience": "July 02, 2023",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "It is Good to have this website and…",
        "commentaire": "It is Good to have this website and more usefull.",
        "nombre_reviews": 9,
        "date_experience": "February 04, 2021",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "UA",
        "Titre": "Хорошая компания все отлично работает!",
        "commentaire": "Useful",
        "nombre_reviews": 9,
        "date_experience": "December 15, 2020",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "BD",
        "Titre": "Very Nice.This is great",
        "commentaire": "Useful\n1",
        "nombre_reviews": 9,
        "date_experience": "April 04, 2021",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union ",
        "User": "NA",
        "localisation": "KH",
        "Titre": "Give me 200$🙏",
        "commentaire": "Useful",
        "nombre_reviews": 9,
        "date_experience": "March 18, 2023",
        "reply": null
    },
    {
        "company_name": "ASDFTEST ",
        "User": "NA",
        "localisation": "US",
        "Titre": "time for __proto__.asdf",
        "commentaire": "time for __proto__.asdf\nbh",
        "nombre_reviews": 1,
        "date_experience": "November 24, 2022",
        "reply": null
    },
    {
        "company_name": "ATM Together ",
        "User": "NA",
        "localisation": "GB",
        "Titre": "The only reason I’m not sure is that",
        "commentaire": "The only reason I’m not sure is that",
        "nombre_reviews": 1,
        "date_experience": "June 01, 2024",
        "reply": null
    },
    {
        "company_name": "WPC Merchant Services & Credit Card Processing ",
        "User": "NA",
        "localisation": "ET",
        "Titre": "I have above 10 years exprince both…",
        "commentaire": "I have above 10 years exprince both commericial bank and abyssinia bank\nIn order to adress all customer using cardeless opration only by right hand thumb or by eye and avaible for all with out asking permission to customer",
        "nombre_reviews": 1,
        "date_experience": "September 17, 2022",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM ",
        "User": "NA",
        "localisation": "GR",
        "Titre": "I don't know much about Cryptocoins!",
        "commentaire": "Useful",
        "nombre_reviews": 2,
        "date_experience": "March 22, 2024",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Awful. Scam. BBB rating \"F\"",
        "commentaire": "Purchased $10,200 in bitcoin, never able to move my bitcoin to transfer, or to move to another wallet. Assistance sought, FAKE WALLET! Sought assistance, repeated replies in Russian, I am not able to read or speak Russian--asked for English -- never provided nor replied. Also, repeated pleas for assistance or phone call ignored. Horrible experience",
        "nombre_reviews": 2,
        "date_experience": "December 28, 2023",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM ",
        "User": "NA",
        "localisation": "US",
        "Titre": "25% fees not documented anywhere",
        "commentaire": "25% fees not documented anywhere. Avoid at ALL costs. Will never use this ATM company again.",
        "nombre_reviews": 2,
        "date_experience": "July 09, 2023",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM ",
        "User": "NA",
        "localisation": "US",
        "Titre": "This daniel hayslip Becky station Beth…",
        "commentaire": "This daniel hayslip Becky station Beth Jordon cashed checks Becky hayslip Larry hayslip anda clark Candice noes about all on dip rapinig kids and all sick won't them in jail jelyce over phone I have not don non this donnie walkions in on it to ask how howerd merfey Denise fisher getting cards actavated keven marsh and jonny hayslip jonny wilder took cops scaminug linked jimmy station edd scoot charles shorts doughter all in one n stalking kids malisa ricky vangundi noes and fload Carl doughter stalking kuds",
        "nombre_reviews": 2,
        "date_experience": "August 13, 2022",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM ",
        "User": "NA",
        "localisation": "ET",
        "Titre": "Adiss Ababa shager",
        "commentaire": "Ayat Rilestet Apartment",
        "nombre_reviews": 2,
        "date_experience": "January 13, 2024",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Dwight welding is a bitchhhh asss rep…",
        "commentaire": "Dwight welding is a bitchhhh asss rep who couldn’t help unlock my acct 4405145893 this fuks charge 20$ off every 100$ thieves",
        "nombre_reviews": 1,
        "date_experience": "June 08, 2023",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I have been using Cryptobase ATM…",
        "commentaire": "I have been using Cryptobase ATM machines for over 3 years now. All of them are safe and secure which makes me feel comfortable using them every time. I appreciate all of their support when I was having trouble with my wallet",
        "nombre_reviews": 1,
        "date_experience": "July 31, 2022",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Cryptobase is the only name I trust…",
        "commentaire": "Cryptobase is the only name I trust when I am looking to buy crypto currencies like bitcoin with cash. 5 stars without a doubt",
        "nombre_reviews": 1,
        "date_experience": "July 29, 2022",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I am not sure what some of these…",
        "commentaire": "I am not sure what some of these previous reviews are talking about. The Cash Express I deal with does not have an app to download. They do not use a card reader or have an ATM in their locations, They are only based in Oklahoma and I have never had any of their representatives be rude or hateful. They have always gone far and beyond to help me. I do believe people need to make sure they are adding a review on the right business.",
        "nombre_reviews": 1,
        "date_experience": "June 17, 2023",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "The district",
        "commentaire": "Florence location hasn’t had their card reader available to their customers. Card reader nor ATM available for sometime . The response is i don’t know when it will be fixed may not be next week. That’s fine i expect the worker not to know the exact time and date. But its has been too long for me not to use my card at my convenience to pay the company back in their store. I reached out to customer service sweet lady she did not understand why Florence muscle shoals and Athens more than likely card readers are not working for their customers. She patched me thru to the district manager, for her to be a district manager she is top line unprofessional rude and disrespectful. The loyalty and respect don’t like up in this district starting with the district manager and i will not refer a soul!",
        "nombre_reviews": 1,
        "date_experience": "May 31, 2024",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "NG",
        "Titre": "THEY ARE FULL OF FRAUDULENT ACTS",
        "commentaire": "This app is so useless and full of fraudulent acts. One of their online marketers called my phone to advertise this useless app to me, firstly I refused that I needed not to borrow, he finally convinced me. After I installed the app, I requested for a loan at the end I was not ok with the offer then I neglected it, only for me to wake up the next morning to discover money paid into my account from this app without my approval. I was shocked because I was supposed to accept this offer before the money can be disbursed into my account but in this case no, it wasn't like that. Immediately I had to send email messages to the email addresses I saw online but didn't get any response. I tried to call the fool who contacted me to advertise the app to me but his number was not been reachable. To worsen the case, a week later their online customer started sending messages, death threats, posting negative things about me. I had to call the WhatsApp number that sent me messages and this foolish girl had the nerves to start laying curses on me and my family because of a token I never bargained for. Please guys, to avoid the type of experience and embarrassment I got from these app, please I advise you avoid this app. They are thieves in disguise.",
        "nombre_reviews": 1,
        "date_experience": "May 29, 2024",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "ZA",
        "Titre": "Cash Express has the best services when…",
        "commentaire": "Cash Express has the best services when it comes to their customers.Everything is Easy and Fast compared to other services provided by other organizations.I Trust Cash EXPRESS WHOLE HEARTEDLY",
        "nombre_reviews": 1,
        "date_experience": "October 21, 2021",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "This daniel hayslip this my account…",
        "commentaire": "This daniel hayslip this my account won't cops to arest them ronda hayslip Ben actavatinug cards Alisa hayslip fload all rapinig mesinug kids and angi",
        "nombre_reviews": 1,
        "date_experience": "August 13, 2022",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "To get my money deposited to a cash app…",
        "commentaire": "To get my money deposited to a cash app so I can get my refund back today actually Ashley Houston Macon Missouri",
        "nombre_reviews": 1,
        "date_experience": "January 27, 2023",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Two workers, Two different answers",
        "commentaire": "I went into cash express on Eastern Bypass. I went in early because I got my check early. I ask the girl who waited on me if it would be a problem paying early. She says no, I don't see a problem with it. So I reborrow, after paying. Next month comes and a different girl calls and says I am down to pay that day. I said I don't get my check till the first and the 3rd. She says we'll the 3rd is 4 days out. I said well I get a check the first also and that is 2 days out. She says well your check may be here when you come or it may not be. I said well do what ever you have to but I don't get paid till the first and 3rd. Can come in the first. So today I look at my bank account and sure enough she had turned it in and it's pending. I don't care mind you but the other girl had told me it would be fine. This dark haired girl that called me has always been so hateful. I always avoid having to deal with her and always go to the other register. The black haired girl is a very pretty girl but her attitude and personality and hatefulness does not go with her beauty. But how is one worker saying one thing and another worker saying another helping at all. I been going there for a few years. I will be finding another location. I will go to the one on Main Street. Evidently paying early makes a whole lot of difference.",
        "nombre_reviews": 1,
        "date_experience": "September 01, 2022",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "IN",
        "Titre": "Nice Service",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "March 15, 2021",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "NG",
        "Titre": "My app is fell so I want renew",
        "commentaire": "My app is fell I need to renew",
        "nombre_reviews": 1,
        "date_experience": "August 20, 2023",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "KH",
        "Titre": "Good for saving money",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "May 21, 2023",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "They try to bully elderly folks",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "November 10, 2021",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Shane Kinney",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "January 14, 2023",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "ID",
        "Titre": "good i like this",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "November 03, 2020",
        "reply": null
    },
    {
        "company_name": "Cash Express ",
        "User": "NA",
        "localisation": "MM",
        "Titre": "Good I like it",
        "commentaire": "Useful",
        "nombre_reviews": 1,
        "date_experience": "November 17, 2020",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Highly recommend you DONT do business…",
        "commentaire": "Highly recommend you don’t do business with them. Heritage sent me a letter in the mail about “pre qualification” awesome I’ll give it a go I’ve had my car for some time maybe there’s a lower/better rate. Mark sent me a message after I applied for my refinance that he already had me matched with a few lenders. I mixed up 2 numbers on my application as I have slight dyslexia, he then tells me that everyone has denied my application…after he told me he already had me matched and he was putting numbers together. I fixed the numbers that I had mixed up on my application for him to tell me that they’ll get back but the end of the month is busy for “new applications only” so I may not hear back as quickly as my first application…fine no big deal. It has now been a month. I feel like I’ve been pretty patient and I saw good reviews about the company before I had applied. However, this is just my experience. Take it as you will.",
        "nombre_reviews": 1,
        "date_experience": "September 28, 2023",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Heritage has been amazing",
        "commentaire": "Heritage has been amazing, I live an hour from any office and still will not use anyone but Heritage Valley, I know if I need anything, I can call and get nothing less than professional yet family like assistance,\nHeritage has helped me with everything from my home mortgage to the purchase of my automobile. Thanks",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Bill, thank you for your review, and expressing your satisfaction with our call center. We're glad that we can help you with your mortgage and auto loan too!",
            "reply_date": "Wednesday, September 8, 2021 at 04:28:54 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Open a dialog of settlement with Customer…",
        "commentaire": "I have been a customer of HVFCU for over 17 years. When I started to run behind in my credit card payments, instead of contacting me to see if they could negotiate a reason or settlement with me, they opted to sue me. Most companies that care about their customers try to create an open communication to assist when a client falls behind. That is if they really care about their customers.",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I have used HVFCU for decades!",
        "commentaire": "I have used HVFCU for decades! Very helpful and responsive online help. Courteous and friendly tellers. We have had numerous loans through them, car and personal. We also just refinance to a 15 year mortgage. The processes were always very smooth. Would definitely recommend!",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you for being a long time member, and for leaving an amazing review. We're always happy yo hear how we help our members in all aspects of their financial journey.",
            "reply_date": "Wednesday, September 8, 2021 at 04:31:21 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Heritage Valley is an amazing company…",
        "commentaire": "Heritage Valley is an amazing company filled with so many helpful people. They helped me consolidate my debt, which helped my credit score increase over time.",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you for your review. We're always happy to help!",
            "reply_date": "Wednesday, September 8, 2021 at 04:15:23 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Satisfied Long Term Client",
        "commentaire": "I have been a member of Heritage Valley Federal Credit Union for 35+ years. My 3 sons were members since they were children when they had the dinosaur accounts. We love doing business with the credit union. Patricia, Marcus, Michael and Stephen",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Pat, thank you, and your sons for being a long-time members!",
            "reply_date": "Friday, September 10, 2021 at 03:17:08 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Had a great experience with a Home…",
        "commentaire": "Had a great experience with a Home Equity Loan. It was a super easy and fast process and would recommend them to anyone looking for this type of loan.",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you Chris for your review. We are glad that you had a great experience with getting a Home Equity Loan.",
            "reply_date": "Wednesday, September 8, 2021 at 04:16:10 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I have been with HVFCU for years",
        "commentaire": "I have been with HVFCU for years! The team is friendly and helpful no matter what your concerns or needs are - loans or account questions are quickly resolved.",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you for your review Jayne!",
            "reply_date": "Wednesday, September 8, 2021 at 04:26:12 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I have been a member for years with…",
        "commentaire": "I have been a member for years with HVFCU and the staff are always smiling & happy to greet you and help you in a way. If I have a problem on line they are quick to fix the problem. I enjoy using their friendly; easy app as well!",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you for your review Cathy. We're always happy to see your cheerful face too!",
            "reply_date": "Friday, September 10, 2021 at 03:18:01 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Helped Grow My Family & Business!",
        "commentaire": "I have been with HVFCU for many years now. They have helped me grow my family and business alike. From vehicle loans to great rates on business accounts, it has been a great experience from start to current date!\n\nThank you, HV!",
        "nombre_reviews": 1,
        "date_experience": "September 05, 2021",
        "reply": {
            "reply_text": "David, thank you for your five-star review! We appreciate your kind words, and so happy we can help.",
            "reply_date": "Tuesday, September 7, 2021 at 12:18:39 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Good for the most part",
        "commentaire": "Good for the most part. Their app / website can be confusing and weird at times.",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you for your review and feedback. If you wouldn't mind sharing some specifics on what is confusing about our app / website, we can address the issue and try to create a smoother experience for you and our other members.",
            "reply_date": "Wednesday, September 8, 2021 at 04:36:17 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union ",
        "User": "NA",
        "localisation": "US",
        "Titre": "We are new to HVFCU",
        "commentaire": "We are new to HVFCU, pleased with their banking.\n\nI also like the free coin counter!",
        "nombre_reviews": 1,
        "date_experience": "September 08, 2021",
        "reply": {
            "reply_text": "Thank you Jim for your review. The coin counter is a great time saver!",
            "reply_date": "Friday, September 10, 2021 at 03:16:14 PM"
        }
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "They are not a bank,there a bunch of…",
        "commentaire": "They are not a bank,there a bunch of soulless witches making pbj an pretending just to screw your nerves an patience. What flipping souless blind see a transfer an can't see it through on a weekend!!!",
        "nombre_reviews": 4,
        "date_experience": "June 14, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I requested my 100$ in cash rewards…",
        "commentaire": "I requested my 100$ in cash rewards that I earned on June 9th and I still didn’t get any money 7 days later so I called the bank and they told me I had already received my cash back on May 20th a month ago. I just requested the money 6 days ago I told them and still haven’t seen anything. They told me I was wrong and was already credited. Anyway my account is still the same so I guess I was screwed",
        "nombre_reviews": 4,
        "date_experience": "June 16, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Please stay way from PNC banking",
        "commentaire": "Please stay way from PNC banking. It was the most stressful and frustrating experience I’ve ever had with a bank. There are a lot of better options out there for banking. Do yourself a favor and look elsewhere.",
        "nombre_reviews": 4,
        "date_experience": "June 12, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "PNC Bank is a really awesome place.",
        "commentaire": "I believe PNC Bank is doing an awesome job for me. I switched from First Citizens because of fraud and fees. All the teller's are very nice, and with online banking, i can just bank any place i need. PNC, my name is Leonard, and i appreciate all that you do, an for helping me.💯",
        "nombre_reviews": 4,
        "date_experience": "June 03, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "PNC branch tellers are fantastic, Corporate Management is Out of Touch",
        "commentaire": "PNC branch tellers are fantastic. Corporately the management is out of touch and not interested in the customer experience. The integration of BBVA should be considered a criminal offense & unfortunately today's PNC still suffers from it. If you want to be chiseled with fees open an account with this poorly run bank - $95 fee for a Domestic Business to Business Wire!",
        "nombre_reviews": 4,
        "date_experience": "June 13, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "I would rate it a 0 if I could",
        "commentaire": "I would rate it a 0 if I could. I was happy with BBVA where I had all of my money as customer service was decent, rates were compete and location was convenient. Then about 2 1/2 years ago they got bought out by PNC Bank. Immediately after all hell broke loose. I went down there and sat in line for 3 days before I got to meet with a teller. I had decided during this time I should take all of my business account money out and I am so glad I did. My poor wife left some money in an account and in 2 years time over $1000 was ‘lost’. I appears that predatory bank fees were assessed in this one account causing it to evaporate in a little over two years. She never used the account; no checks, no withdrawals, no nothing. Amazing.",
        "nombre_reviews": 4,
        "date_experience": "June 12, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Horrible banking practices",
        "commentaire": "Guess I’ll add to the negative here cause this bank is horrible!!! Been banking with them for about 25 years and other than a credit card they never were able to approve a loan for us! I’m sick of this bank using my money to lend money out but not able to loan it to me!\nWe just fully paid off a credit card with about 10k on it… like we do every summer, so we have a card to use on vacation. We just got a letter in the mail that they were dropping our limit from 10k to 1k of which we have a balance of $450! I told them that in doing that it will more than likely drop my credit score cause my usage was almost 50% and will surely screw up our DTI ratio, should we need a loan. They did not care at all!\nWhen I get back from vacation we are switching banks immediately cause this is the final straw in dealing with this horrible bank!\nWe bank commercial, personal and have 4 cards with them… kick rocks PNC!",
        "nombre_reviews": 4,
        "date_experience": "June 07, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "TR",
        "Titre": "Online banking access",
        "commentaire": "Contacted Pnc customer service because I’m traveling and can’t log in to my online banking because I can’t receive a one time passcode to my US phone number. Did all the verification process. I asked if I can get the code to my email instead she said no. The representative was unprofessional, rude and useless. When I ask her to speak with a supervisor she hang up on me. I want a call back from a supervisor to put a formal complaint in. Now I’m stuck at the airport with no access to my money.",
        "nombre_reviews": 4,
        "date_experience": "June 07, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Worst bank for commercial",
        "commentaire": "Worst bank for commercial. The lender was not responding on time and the bank branch manager said he will get back to me and he also did not respond at all. Everyone just went quiet and no response. All these happened after getting from me all of our finance details. What a bad customer service?",
        "nombre_reviews": 4,
        "date_experience": "May 30, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "No one is ever, available.",
        "commentaire": "This is the third time that I have been into the bank in Hampstead and asked for someone to help me with my bank account.\nThere is never anyone available to speak with me.\nTwo times I was told that it be an hour wait to talk with someone. (Today)\nOne time I was told, that I could wait and it would be a few minutes. I waited 30, and then I went into Wilmington to be waited on in 5 minutes.\nNot nice!",
        "nombre_reviews": 4,
        "date_experience": "June 14, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Run Away!! Do not walk",
        "commentaire": "PNC Bank. We will never do business with them again. My wife and I Got a Car loan from them at the Dealership because they were the lowest interest rate at the time. Our first payment was due in 6 weeks. We kept looking for the first payment in the mail but it never came. So we called. They mail the bill two weeks before it is due. That means you get the bill one week before they start charging you additional interest. I find it to be the closest thing to a scam there is. They intentionally send you the bill late to collect higher interest fees. Making payments online or over the phone is difficult and tedious at best. This billing practice should be outlawed and a class action suit should be filled against them.\nNever again will we do business with such an immoral company that skirts the law like PNC Bank. Run do not walk away from any dealings with PNC bank or any other like this.",
        "nombre_reviews": 4,
        "date_experience": "June 07, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "ID",
        "Titre": "BEWARE! DO NOT RELY UPON THEIR CARDS ABROAD!!",
        "commentaire": "Domestically PNC is great \"BUT\" DO NOT rely upon their credit or debit cards when abroad!!!!\n\nI have dealt with nothing but chaos for past three years when traveling with their cards. Unfortunately, they just are not set up for international transactions or business. You can not call them, you can not verify anything because they require text codes which too often you can not receive and thus they will then lock your card. Too often you will have to sit on hold for at least 30min at $1-$2 per minute just to speak to someone. Then there are issues at most ATM machines abroad. If you don't remember to inform them of your travels prior to leaving expect your card to be locked and cycle of trying to reach them repeats. They expect you to inform them of your travel every 30 days therefore you will repeat cycle of chaos trying to reach them.\n\nMake your life simple and do not use their cards abroad!! You have been warned!! Lol.\n\nI found internationally it's best to go with either more Chase or Bank of America unfortunately.",
        "nombre_reviews": 4,
        "date_experience": "June 03, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "They just hung up",
        "commentaire": "My online banking was suspended after I used my debit card while travelling in China. I called customer support, verified some details, was asked to hold, then they simply hung up. This happened 3 times in a row. Still not able to use my online banking.",
        "nombre_reviews": 4,
        "date_experience": "May 31, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Real Reason PNC Bank online banking was down...",
        "commentaire": "Please note the real reason PNC Bank was down on 5/18 is because there are severe problems with its Back Office accounts. PNC Bank is woefully inept when it comes to online banking and the bank needs a major upgrade of its systems to prevent fraudulent activities. It is unheard of online banking to be down so many times as PNC Bank. BEWARE of PNC Bank!",
        "nombre_reviews": 4,
        "date_experience": "May 17, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "What a horrible company for fraud",
        "commentaire": "What a horrible company for fraud. Never in my life have I had such a sh-t experience. PNC needs to be ashamed but I’m sure they are not. For 2 transactions it took almost 3 hours to get refunds and that part I was told won’t happen until tomorrow. I lost track of all the 6 digit codes I received. Then this and then that. We have been with PNC for years but after this we may move on. Just horrible. 🤮🤬😡😭😤",
        "nombre_reviews": 4,
        "date_experience": "June 03, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Pnc error causes a family to suffer",
        "commentaire": "I went to a Pnc atm to withdraw $600 and the atm said there was an error despising the money but also took the money from the account. I talk to 3 different bank employees and they said I was pretty much screwed for up to 10 days until they can verify the issue. This was there fault and now I’m being punished for there error. I only have $69 dollars to my name and it’s a holiday weekend plus I have kids I will be closing my account with pnc",
        "nombre_reviews": 4,
        "date_experience": "May 23, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Unethical company!",
        "commentaire": "Many years with this company and due to a glitch, my credit limit was lowered without notification. This was reported to my credit report and also included an OVER THE LIMIT report!!! My credit decreased 24 POINTS! Their Customer Service is HORRIBLE!! PNC has gone downhill. I've transferred my balance to Capital One, and am so happy with them!! Save your wallet and Credit by AVOIDING PNC!!",
        "nombre_reviews": 4,
        "date_experience": "May 04, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Deplorable bank",
        "commentaire": "Deplorable bank. I just opened an account. I made a large deposit on the on line banking app. They took my money out of my account from another bank which was In my name. They are going to hold my money for a week before they allow me to access it. I will transfer my funds out and close the account as soon as they release my money. Beware of this scamming cheating bank. They are using my money and I cant pay bills. Scary institution. Holds were never mentioned when I opened the account. Laredo Texas Branch. Use caution with PNC bank.",
        "nombre_reviews": 4,
        "date_experience": "May 28, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Worst bank ever",
        "commentaire": "Worst bank ever! Please if you’re not banking with them don’t. They charge for everything and there online banking sucks",
        "nombre_reviews": 4,
        "date_experience": "June 12, 2024",
        "reply": null
    },
    {
        "company_name": "PNC Bank ",
        "User": "NA",
        "localisation": "US",
        "Titre": "Unfair and Untruthful",
        "commentaire": "Several years ago our mortgage was sold to PNC without our knowledge or consent. We made payments to them for many years with no problems. Recently we were in a position to pay off our balance. There are no physical locations close to us, so we drove 90 miles to the nearest branch in Owensboro Ky. We met with a gentleman who explained that he would contact the payoff dept and they would fax him a final payoff amt. He asked us to return in a couple of hrs and he would have that payoff statement for us. We came back later, as directed, and he gave us a letter stating the final payoff if it was pd in 10 days. We went to our personal bank the next morning and got a cashier's check FOR THAT AMOUNT IN FULL and mailed it immediately. Imagine our surprise a few days later when the bank called and said that we didn't pay enough!!! They claimed that we still owed another $150. When I pressed the caller as to why we still owed she kept saying someone made a math error on their end or they keyed in the wrong figure by mistake. This is unacceptable! They CONVENIENTLY offered to take the amt from our escrow acct which we had been assured would be refunded. This is wrong, unfair and PNC pulled a fast one.",
        "nombre_reviews": 4,
        "date_experience": "May 24, 2024",
        "reply": null
    }
]