[
    {
        "company_name": "Evergreen Credit Union",
        "User": "The Noyes Family",
        "localisation": "US",
        "Titre": "Exceptional Service From Entering to Exiting!",
        "commentaire": "We wanted to extend our gratitude to the exceptional team that works at the Riverside Evergreen Credit Union branch. The atmosphere promoted at ECU is inviting, friendly, professional, efficient, and caring. Whether you are making a deposit, lost your debit card, or are taking out a loan... you will be taken care of by this incredibly accommodating and lovely team.\n\nThank you for the many years of exceptional service!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "customer",
        "localisation": "US",
        "Titre": "I was anxious when I called egcu.org on…",
        "commentaire": "I was anxious when I called egcu.org on Monday March 30, 2024. I spoke with Sara Adams and an IT person (Paul?). Sara is an asset to the establishment, helpful and knowledgeable. I want this commendation to be part of her permanent personnel record and for her to be recognized for her fast, courteous service! Thank you Sara.\nLinda A. McCann",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Natalie Thompson",
        "localisation": "AU",
        "Titre": "Some of the most help and friends…",
        "commentaire": "Some of the most help and friends people I know easy to find and allways smiling to see U and good to know what I was doing",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Donna Lamb",
        "localisation": "US",
        "Titre": "Best Credit Union",
        "commentaire": "I have been with Evergreen Credit Union for many, many years and look forward to many more years. in all of those years everyone associated with Evergreen has been helpful and a pleasure to do business with and very, very pleasant. This includes everyone tellers, customer relations people, mid level management, top dogs. I could thank a lot of the staff by name at the credit union but it would include everyone. I would like to congratulate Evergreen Credit Union for building such a fine organization. Evergreen Credit Union is a wonderful partner and participant in the neighborhood and beyond. Kudo's Evergreen keep up the good work.",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Hi Donna,\n\nThank you very much for the kind words! We're so happy to have built a credit union that can serve community members just like you.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:38:20 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Ken",
        "localisation": "SE",
        "Titre": "Security",
        "commentaire": "I called the Evergreen's Portland location on Saturday, 04.20.2024. It seemed a log in change had been made which asked if I were an adult. The posting was done by Cloudflare.\nThe potential for a possible scam or worse gave me pause before answering. The 'authentication' (I guess) somehow gave sufficient proof so I was then able to log into my account.\nI also had a rather minor request to edit the names on specific accounts.\nMy call was taken by Danielle and together we were able to address and resolve.\nHaving employees who feel professional yet personable service are critical in securing confidence in both Evergreen and their employees.\nYour mission and mine were met by Danielle.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Ken,\n\nThank you for sharing you Evergreen Experience with us! We're happy to see that Danielle helped answer your questions. As always, please let us know if you have any questions about your account.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:35:42 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "customer",
        "localisation": "US",
        "Titre": "Pleasant Dealings",
        "commentaire": "Denise Manchester was very helpful and I’m glad I connected with her. All staff were polite and helpful.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hello,\n\nThank you for letting us know about your experience. We're happy to hear that Denise was able to help you!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:34:00 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "WCS",
        "localisation": "US",
        "Titre": "I have spoken with Lilly twice in two…",
        "commentaire": "I have spoken with Lilly twice in two days. Lilly was extremely patient and incredibly helpful!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi there,\n\nThank you for sharing your experience with Lilly! As always, if you have any questions about your account give us a call at (207) 221-5000 or visit your closest Evergreen branch.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:28:20 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Erica Houston",
        "localisation": "US",
        "Titre": "Thank you so much for helping me out…",
        "commentaire": "Thank you so much for helping me out ☺️🙏🙏🙏☺️☺️ I am having a blessed day today ❤️❤️❤️🌹❤️",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": {
            "reply_text": "Hi Erica,\n\nWe're so happy you had a great experience with us! Have an amazing day!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:27:24 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Joshua Walton",
        "localisation": "US",
        "Titre": "My call to Member Services was answered…",
        "commentaire": "My call to Member Services was answered immediately. Rebecca fixed my issue promptly and walked me through the process until it was resolved. I appreciate this level of customer service. It is rarer these days and certainly doesn't go unnoticed. Thank you!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for your review, Joshua! We're happy Rebecca was able to efficiently resolve any issues you had!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, March 26, 2024 at 03:48:21 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "customer",
        "localisation": "US",
        "Titre": "Very helpful and quick service!",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Maegan Reinhart",
        "localisation": "US",
        "Titre": "Great Experience",
        "commentaire": "Sarah was promptly responsive and made the transaction so easy from beginning to end. Will definitely be working with her again!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Maegan,\n\nThank you for sharing your great experience with Sarah! Our team is happy to help.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, May 6, 2024 at 07:32:35 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Heidi Hoffman",
        "localisation": "US",
        "Titre": "Great people and banking experiences",
        "commentaire": "I have known about Evergreen Credit Union since my grandmother was a member when it was SD Warren credit union in Westbrook. Evergreen has helped me many times with not only banking but personal & auto loans as well as my family and friends. The staff I have worked with & interacted with at Evergreen are friendly, personable and willing to help whatever my needs might be. I feel good knowing I can make a call and whomever I speak with will try to help or find someone who can, and I look forward to many more year's banking with Evergreen. Thank you!",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Thank you, Heidi! We love hearing about families coming to Evergreen. We're happy to help.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:51:31 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "M M",
        "localisation": "US",
        "Titre": "Chelsey C has helped me…& continues to…",
        "commentaire": "Chelsey C has helped me…& continues to help me….as I rebuild following divorce. She is kind & empathetic…she works hard for creative solutions…& has helped me tremendously….allowing me to see the steps I need to take to achieve my goals. She is a true and genuine treasure. ECU is lucky to have her.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for sharing your experience with us! Chelsey is amazing, and we're glad she has helped you time and time again.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:52:29 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Denise Asselin",
        "localisation": "US",
        "Titre": "Happy customers…",
        "commentaire": "We like having our financial services locally. We have been With Evergreen Credit Union for over 30 years. They have very knowledgeable representatives who go out of their way to help us. They are truthful with their dealings with us. It is nice to know we can get the solution that fits our needs, at a reasonable price.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We're happy to help you every step of the way, Denise. Thank you for your long-term membership, and for sharing your experience with us!\n\nBest,\nEvergreen CU",
            "reply_date": "Tuesday, February 20, 2024 at 07:56:52 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "customer Mary Fuller",
        "localisation": "US",
        "Titre": "The staff is courteous",
        "commentaire": "The staff is courteous, respectful and knowledgeable about my questions and concerns. They are extremely responsive whether in person or on the phone. They always thank me for being a customer. I was with a bank for 45 years prior to joining Evergreen and never felt appreciated the way I have since joining Evergreen. I have already referred a number of friends to join.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for leaving a review, Mary! We're happy to help, and lucky to have you as a member.\n\nBest,\nEvergreen CU",
            "reply_date": "Thursday, February 29, 2024 at 07:51:57 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Bri Mor",
        "localisation": "US",
        "Titre": "Jennel Berry was such a huge help…",
        "commentaire": "Jennel Berry was such a huge help though out the entire process.\nI mentioned during the first meeting that I was nervous, Jennel calmly walked me through the initial process.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Diana Dolstra",
        "localisation": "US",
        "Titre": "Thanks to ECGU's debit/credit card fraud staff",
        "commentaire": "I really appreciate the debit/credit fraud department of Evergreen Credit Union. They have caught unauthorized use of my debit card at least twice, and had my new card waiting for me at the credit union within half an hour. All the staff have been very helpful, pleasant, efficient and have saved me a lot of grief by catching fraudulent use of my debit card.",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Thank you for leaving a review with us, Diana! We're happy to bring you ease of mind. As always, give us a call if you have any questions.\n\nBest,\nEvergreen CU",
            "reply_date": "Monday, March 4, 2024 at 08:50:26 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "L Perry",
        "localisation": "US",
        "Titre": "would definately recommend",
        "commentaire": "After much research we found this credit union offered the best interest rate on an auto loan. The branch manager who assisted us was friendly, knowledgeable and genuinely interested in helping make the experience pleasant and efficient. I would definitely recommend the credit union and look forward to doing business with them.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "John and Rose Duran",
        "localisation": "US",
        "Titre": "We found Judy Brochu to be sincerely…",
        "commentaire": "We found Judy Brochu to be sincerely warm and friendly. Anyone can read a script but Judy was obviously doing more than that.\n\nShe was knowledgeable and patient and took our information and passed it on by email to the correct department. A few days later the outcome that we requested showed up on our Consolidation Loan.\n\nThank you, Judy.\n\nJohn and Rose Duran",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi John and Rose,\n\nThank you for sharing your experience with us! We're glad Judy helped you with your loan needs.\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, December 26, 2023 at 06:58:07 PM"
        }
    },
    {
        "company_name": "Evergreen Credit Union",
        "User": "Lisa A Barry",
        "localisation": "US",
        "Titre": "Efficiency",
        "commentaire": "The woman in the office to the left as you enter the bank (Julie?) helped us as she could see that the tellers were busy. She invited us into her office and helped us with a kind and professional manner. Always a warm and welcoming experience at the South Portland branch. We are excited about the new branch in Scarborough opening.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you, Lisa! We're happy you had a great experience at our South Portland branch. We're very excited to open our Scarborough branch!\n\nBest,\nEmma\nEvergreen CU",
            "reply_date": "Tuesday, January 2, 2024 at 04:15:32 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "customer Tonya Hendricks",
        "localisation": "US",
        "Titre": "What went wrong with this was I was… unable to get cash back while depositing phones into my account",
        "commentaire": "What went wrong with this was I was trying to deposit a check and to my account I needed to get a portion of it back. Was denied because apparently it’s a new account and my check would have to be held for seven days before the funds were available. This does not work for me, I live on a limited income and have bills to pay. It’s been almost 2 weeks since I opened my account. I still have not received a debit card which is why I was requesting cash back from the phones I was depositing I also use Venmo quite often, yet , I discovered after opening the account that liberty first does not allow you to use Venmo. A lot of people use Venmo these days. It would really make it helpful to folks if they were still able to use this app. I get money and I send money through Venmo a lot .",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Usikelelwe",
        "localisation": "ZA",
        "Titre": "Great customer service",
        "commentaire": "Great customer service, they care about their customers so much & are so attentive . It is definitely a bank with a purpose & that is to make our finances easier",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you, we are happy to have you as a member!",
            "reply_date": "Friday, May 10, 2024 at 08:35:19 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "customer",
        "localisation": "US",
        "Titre": "Friendly and informed me on each step",
        "commentaire": "Friendly and informed me on each step . Front staff were very helpful with starting my account.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you, we are so glad you had a great experience and are happy to have you as a member!",
            "reply_date": "Friday, May 10, 2024 at 12:32:49 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "BB",
        "localisation": "US",
        "Titre": "Everything was done very professional",
        "commentaire": "Everything was done very professional, friendly & insightful.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so happy to hear you had a great experience.",
            "reply_date": "Monday, May 13, 2024 at 04:44:20 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Carol P",
        "localisation": "US",
        "Titre": "I called to inquire about a car loan…",
        "commentaire": "I called to inquire about a car loan and Mellie walked me through the process. I went to the branch to sign paperwork that was waiting for me when I walked in the door. Mellie called a few days later to follow up to see where I was in the purchasing process. She has been kind and helpful and answered all of my questions, even when I asked them two or three times.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Carol, we are so glad that Nellie was able to help you and that you had a great experience!",
            "reply_date": "Wednesday, April 17, 2024 at 12:29:19 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Natalie K",
        "localisation": "US",
        "Titre": "Super helpful and friendly employees",
        "commentaire": "Super helpful and friendly employees. They go above and beyond to help!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you, Natalie, we are glad you had a great experience.",
            "reply_date": "Tuesday, April 30, 2024 at 04:18:52 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "MMT",
        "localisation": "US",
        "Titre": "Exceptional!",
        "commentaire": "Joe Evans was amazing at getting my car loan done in an exceptional timely manner! I plan on transferring all my banking to Liberty First!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so glad you had a great experience, and that Joe was able to get it done in a timely manner.",
            "reply_date": "Wednesday, April 3, 2024 at 12:28:30 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Deborah Fields",
        "localisation": "US",
        "Titre": "Everyone that I helped me was very nice…",
        "commentaire": "Everyone that I helped me was very nice and courteous. Willing to help and give advice.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We thank you for your review and are happy we could help!",
            "reply_date": "Wednesday, May 1, 2024 at 12:20:18 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Jim",
        "localisation": "US",
        "Titre": "Brian Crawford was super helpful & fun…",
        "commentaire": "Brian Crawford was super helpful & fun to work with & you had a very attractive rate for the term we needed.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so glad that Brian could help you. Thanks for being a member of Liberty First.",
            "reply_date": "Monday, April 15, 2024 at 04:49:59 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "customer",
        "localisation": "US",
        "Titre": "Liberty First did a great job keeping…",
        "commentaire": "Liberty First did a great job keeping us informed and updated on the progress. Jason Bell is awesome to work with and truly cares about his clients.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so glad that Jason could help you and that you had a great experience.",
            "reply_date": "Monday, April 1, 2024 at 04:30:56 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Jason B",
        "localisation": "US",
        "Titre": "I’d give liberty first 5 starts any day…",
        "commentaire": "I’d give liberty first 5 starts any day of the week! Everyone was super helpful and they made my first time loan experience fast and easy. I have and will recommend them to anyone I can",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Jason we are so happy to hear that you had a great experience. Thank you for being a member of Liberty First.",
            "reply_date": "Monday, March 25, 2024 at 04:47:35 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Emily Knipe",
        "localisation": "US",
        "Titre": "Great people!",
        "commentaire": "I really loved working with Rhianna Maloney. She is very kind, took time to explain things to me, (I have a lot of dumb questions) and was just overall wonderful to work with. I have recommended her & Liberty First to 2 of my friends now!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Emily, we are so happy that you had a great experience with Rhianna. Welcome to Liberty First Credit Union!",
            "reply_date": "Tuesday, February 20, 2024 at 07:03:15 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "customer Andrea",
        "localisation": "US",
        "Titre": "Very helpful and efficient.",
        "commentaire": "Thank you for your help in acquiring my car loan. It was/is a positive experience. Your loan officer was helpful and efficient.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you so much for being a member. We are glad you had a good experience, and we were able to assist with your car loan.",
            "reply_date": "Friday, March 29, 2024 at 04:22:19 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "TJ",
        "localisation": "US",
        "Titre": "Auto Loan Refinance",
        "commentaire": "I was looking for better terms for my auto loan. Shawna was very helpful and knowledgeable to assist me in getting this done. She made the entire process seamless, with a couple of emails, confidential phone call and in-person closing meeting to sign papers. Very pleased to have much better terms and repayment options in my new loan. Great customer service! Thanks again -TJ",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "TJ, we are so glad that Shawna was able to assist you and make the process easy. We are happy to have you as a member!",
            "reply_date": "Monday, November 20, 2023 at 09:10:32 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Frieda",
        "localisation": "US",
        "Titre": "Initial meeting",
        "commentaire": "I appreciated the detail the banker used to explain opening an account. I felt heard and understood. I felt like we were talking about \"my money\", not the banks involvement. As an older individual I need to feel trust in the persons I choose to assist me.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so glad that you choose Liberty First, thank you for being a member!",
            "reply_date": "Tuesday, January 2, 2024 at 02:03:32 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Robert",
        "localisation": "US",
        "Titre": "I am delighted to be a part of the Liberty Union family.",
        "commentaire": "Everyone I've met at the Branch has been exemplary in dealing with my queries and my business dealings. Service is fast, with no problems that I have encountered at a few banks in the past. CU's are the way to go, you become a part of a family.\nI'm delighted to be part of the Liberty Union family!",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": {
            "reply_text": "We are so happy to have you as a member!",
            "reply_date": "Monday, January 22, 2024 at 01:29:50 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Jill Birkett",
        "localisation": "US",
        "Titre": "Susan Classen was amazing to work with",
        "commentaire": "Susan Classen was amazing to work with. She is so friendly and knowledgeable about what type of checking and saving account we should use. Because of her I have referred many friends and family to Liberty First Credit Union.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you, Jill! We are so glad Susan could help you.",
            "reply_date": "Tuesday, January 2, 2024 at 01:59:31 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "owensrob",
        "localisation": "US",
        "Titre": "Tyler was an absolute pleasure to work…",
        "commentaire": "Tyler was an absolute pleasure to work with we had a few bumps in the road and he was able to conquer them and be able to make the VA loan go through. At this point I'm very impressed with Tyler and his tenacity to get things done and closed",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "We are so glad you had a great experience with Tyler! Thank you for being a member of Liberty First!",
            "reply_date": "Monday, February 5, 2024 at 01:35:37 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "Scott urbank",
        "localisation": "US",
        "Titre": "Said checks were ordered but were not",
        "commentaire": "Said checks were ordered but were not, mobile app will not deposited checks unless turned on? Someone at credit union has to okay this? I get the impression the credit union finds me untrust worthy? If you don’t want my business just say no thank you and I’ll move on",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are sorry to hear about your experience with the check ordering process and for not fully explaining the RDC process we have in place for member protection. We apologize for any frustration this caused you.\n\nWe appreciated the opportunity to visit with you more and get you a direct contact at Liberty First for any future banking needs. We also appreciate you explaining why you were frustrated with the RDC process in more detail so we could understand your complete story.\n\nThank you for being a member at Liberty First! We look forward to a long relationship with you.",
            "reply_date": "Wednesday, November 29, 2023 at 11:16:04 PM"
        }
    },
    {
        "company_name": "Liberty First Credit Union",
        "User": "cJacquie Jordan-Krassustomer",
        "localisation": "US",
        "Titre": "Brian reached out right after my call…",
        "commentaire": "Brian reached out right after my call for information on Saturday morning. Met with him on Monday. He explained so many points from credit reporting & helping my daughter trying to establish credit. Great service!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "We are so glad that Brian was able to help you! Thanks for being a member!",
            "reply_date": "Monday, August 28, 2023 at 07:31:18 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Zakari Aliyu",
        "localisation": "US",
        "Titre": "Wonderful",
        "commentaire": "Simply grea! Excellent way to teach kids frugality and savings early enough. User friendly app and my son loves the confidence of having control over his money with parental oversight. Finally, the card helped me the parent.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Zakari, thank you for this positive feedback! We are so pleased to hear this. - Inaaya 😊",
            "reply_date": "Sunday, May 12, 2024 at 07:08:52 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "customer",
        "localisation": "US",
        "Titre": "Card isn't flexible for kids 16 and older.",
        "commentaire": "The card for my driving age teens isn't very flexible. They go more places and often at restaurants, convenience stores the card doesn't work. A month before the card expired I couldn't use it because another had been issued. So it was nearly a full month we had no use of the card. It's a good idea but just doesn't work for children 16 years or older.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hey there, as an app built for parents by parents, we are always keen to improve our services and make our product better for our parents. Thank you for taking the time to leave us a 3* review. We managed to locate your account via the email provided and we've sent you an email so we can help you on this matter. - Nicola 😊",
            "reply_date": "Monday, May 6, 2024 at 08:51:52 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "customer",
        "localisation": "US",
        "Titre": "Better programs out there.",
        "commentaire": "Better programs out there. Sent reply to gohenry on why I thought gohenry was a waste. One star was as low as I could go. No incentive to be a gohenry member. Go look for something better that provides some incentive. Greenlight is another program out there.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hiya,\n\nThank you for leaving a 1* Review on Trust Pilot, Without these we cannot assist our members in resolving the issues and making GoHenry a better service for our members.\n\nI am disheartened to hear that you feel there are better programmes available for your needs.\n\nWe believe our service does provide value for money as a finance educational tool. I am sorry to hear this has not been your personal experience.\n\nWe understand that our service does not suit everyone but are always keen to better understand an experience so we can do better next time.\n\nI have managed to locate your account using the details provided and have attempted to call you to discuss the issues raised but was unable to reach you.\n\nI have sent you a follow-up email with some additional information to your registered email address, Please may I ask that you review the email and advise of a more suitable time for us to contact you to discuss the points raised.\n\nI am sorry for any inconvenience this may have caused.\n\nMany thanks and I look forward to hearing from you.\n\nThanks\n\nCatherine - GoHenry Supervisor",
            "reply_date": "Monday, May 6, 2024 at 06:03:04 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Consumer",
        "localisation": "US",
        "Titre": "This app is literally the best app I’ve…",
        "commentaire": "This app is literally the best app I’ve ever gotten for my daughter. She completes all her tours and she’s just about to get paid tomorrow. This teaches her and she loves doing all her chores now which is I can get her to do before I downloaded this app that’s why you should download GoHenry today.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi there, thank you so much for your 5* review. It's lovely to hear you are enjoying our service! - Emily",
            "reply_date": "Thursday, May 2, 2024 at 06:53:59 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Duffy Dunton",
        "localisation": "US",
        "Titre": "GoHenry",
        "commentaire": "I love being able to manage my own money, it gives me a good sense of responsibility, and what a great way to learn about financial literacy,",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hey Duffy, thanks for taking the time to leave us a 5* review. We're happy to hear you're enjoying the app, and learning lots about financial responsibility. We're happy to have you with us. - Dan",
            "reply_date": "Thursday, May 9, 2024 at 08:40:05 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Laura Fischer",
        "localisation": "US",
        "Titre": "have not yet figured out how to get the…",
        "commentaire": "have not yet figured out how to get the apps on the kids phones where they don’t see they other 3 kids accounts and balances.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hey Laura, thanks for taking the time to leave us a 4* review. We can certainly assist you further with this! Please get in touch via email; help@gohenrycard.com or phone T: (877) 372-6466 our lines are open from 9am - 5pm EST 7 days a week. Our helpful agents are on standby to assist!- Dan",
            "reply_date": "Thursday, May 9, 2024 at 08:41:51 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "MEGAN WELSON",
        "localisation": "US",
        "Titre": "The only thing I dislike is as a…",
        "commentaire": "The only thing I dislike is as a parent. I think we should be able to make the limit. That could be withdrawn from a savings account. We are saving up for a vacation back home to my home state. And we can't use the money to pay for the things we need to pay in advance. That's a problem. And it should be fixed. It's the parent. It allows it then it should not be an issue that you guys can control...",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Hey Megan, thanks for taking the time to leave a 3* review. There are multiple features that you can set up on your account, and can even lock savings goals so it can't be spent until you want it to. If you'd like some further help with getting this set up, send us an email to; help@gohenrycard.com or give us a call T: (877) 372-6466 our lines are open from 9am - 5pm EST 7 days a week. One of our helpful agents will be happy to help! - Dan",
            "reply_date": "Friday, May 10, 2024 at 08:35:12 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Jennifer",
        "localisation": "US",
        "Titre": "Customer service is generally poor",
        "commentaire": "Customer service is generally poor. It’s a bit better. But overall, the product is not great.",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": {
            "reply_text": "Hi Jennifer, thank you for your feedback! We have been able to locate your account via your email address. As discussed on our call I arranged a callback for you with one of our lovely agents. Thanks. -Delia😊",
            "reply_date": "Saturday, May 11, 2024 at 08:55:54 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Taylor Mahrer",
        "localisation": "US",
        "Titre": "Excellent app for the kiddo",
        "commentaire": "Excellent app for the kiddo. She’s learning Monday skills, building her savings and earning interest. At 11 years old, she knows more about managing finances than many adults I know.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Taylor. Thank you for your 5* review! It is great to hear the GoHenry app is working well for you and your family! - Abbie",
            "reply_date": "Monday, April 29, 2024 at 07:01:36 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "customer",
        "localisation": "US",
        "Titre": "Easy to use and a great learning…",
        "commentaire": "Easy to use and a great learning instrument!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Michael Angelo",
        "localisation": "US",
        "Titre": "I’m sending you to the platform so…",
        "commentaire": "I’m sending you to the platform so let’s see how it goes so far so good",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Michael, we hope you continue to enjoy the app! Thank you for your wonderful feedback. - Inaaya 😊",
            "reply_date": "Monday, May 13, 2024 at 06:49:36 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Linda Clark",
        "localisation": "US",
        "Titre": "The main thing that I greatly dislike…",
        "commentaire": "The main thing that I greatly dislike is NOT BEING ABLE TO ACCESS MY ACCOUNT ON THE COMPUTER! I have a hard time seeing things on my phone and it makes it very difficult. You need to return computer access!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Linda, thank you for your 3* review! We are very sorry to hear that you are unable to access the account from a computer, this doesn't sound right. We managed to locate your account via the email provided and we sent you an email so we can help you on this matter. Thanks. -Delia😊",
            "reply_date": "Friday, May 3, 2024 at 08:58:08 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Suzy Jems",
        "localisation": "US",
        "Titre": "Excellent app",
        "commentaire": "Excellent app. My daughter is doing great with her responsibilities chart. She enjoys the incentive of her weekly allowance. She’s also learning the concept of money and learning how to save her money.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Suzy, thank you so much for your 5* review! It's lovely to hear you and your daughter are enjoying the app. - Emily",
            "reply_date": "Thursday, April 25, 2024 at 06:51:04 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "JDS",
        "localisation": "US",
        "Titre": "Independent child",
        "commentaire": "The app is easy to access and all the information that you need to know about the app is easy to find and very helpful. Me and my daughter are enjoying the ease of GoHenry and all that it brings and helps her to be independent.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi there, thank you so much for your 5* review. We're pleased to hear you are enjoying our service! - Emily",
            "reply_date": "Thursday, April 25, 2024 at 06:50:31 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "David",
        "localisation": "US",
        "Titre": "Really great product for my 9 year old",
        "commentaire": "Really great product for my 9 year old. He is excited about it and engaged in learning about money savings, etc.",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Hi David, thank you for the 5 stars. We are so happy to hear that your child is loving GoHenry! Thanks, Sophie 🙂",
            "reply_date": "Monday, May 6, 2024 at 03:32:38 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Heather Mutchler",
        "localisation": "US",
        "Titre": "Very user friendly app",
        "commentaire": "The app is very user friendly. I am able to navigate it easily and my teen is also able to manage her account easily. Its been a helpful tool for us and we are enjoying it.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Heather, we are so pleased to hear the app has been useful to you. Thank you for the positive feedback! - Inaaya",
            "reply_date": "Sunday, April 28, 2024 at 07:02:46 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Tressa Hills",
        "localisation": "US",
        "Titre": "My daughter is very engaged with this…",
        "commentaire": "My daughter is very engaged with this and she has really started evaluating her spending before buying things.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Tressa! Thanks for your lovely review. We're on a mission to make every kid smart with money, so this review has made our day! - Naomi 😊",
            "reply_date": "Saturday, May 4, 2024 at 06:49:09 PM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Christy Heath",
        "localisation": "US",
        "Titre": "Giving your teenager a reason to Learn, Earn and Save Money with their own debit card",
        "commentaire": "Well it gives me a chance to give my son a card being he's a teenager to learn experience with money and to give him spending money that he works for and he earns thank you so much",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Christy! Thank you for your 5* review! We're so pleased that your child is learning about money with GoHenry. - Naomi 😊",
            "reply_date": "Wednesday, April 17, 2024 at 07:04:57 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Rhe C.",
        "localisation": "US",
        "Titre": "LOVE LOVE LOVE 💕",
        "commentaire": "I absolutely love this app. It teaches me how to be responsible with money saving and it helps me with my money management. I think this is an excellent app for teens and even young adults.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi there, we are glad you feel this way about using our service! Thanks for leaving us a 5* review!- Aliyah 😊",
            "reply_date": "Saturday, April 20, 2024 at 07:14:01 AM"
        }
    },
    {
        "company_name": "GoHenry by Acorns",
        "User": "Angelica Coleman",
        "localisation": "US",
        "Titre": "Good App/ Kid loves",
        "commentaire": "I don’t like how they just take money from my account with no head up. Has put me in some tough situations.\n\nUpdate: Go Henry replied to my review letting me know why I had had some charges. I had actually already figured out the problem and fixed it prior to the response which they also noted. I appreciate them not only reaching out but also being very thorough in their response!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Angelica, thank you for the great 5* review. I was able to locate your account using your email, and I tried to call you, however, I left an email for you regarding this at the registered email address, can you please review this and get back in contact with us if you have any further questions? Thanks. -Delia😊",
            "reply_date": "Saturday, March 30, 2024 at 08:57:30 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Austin Gutheil",
        "localisation": "US",
        "Titre": "These guys are the best",
        "commentaire": "These guys are the best! I never have any hassle with them and the customer service is TOP NOTCH! I wouldn't recommend anyone else BUT Crypto Dispensers! they will always take care of you! I know ill be a life long user for these guys!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Frankie Figs",
        "localisation": "US",
        "Titre": "Great customer service",
        "commentaire": "Great customer service. They give great reward for first time users. Looking forward to watching my $$ grow!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Frankie,\n\nThank you so much for your wonderful review and for highlighting the excellent customer service and rewarding experience you've had with Crypto Dispensers. We are thrilled to hear that you are satisfied with the rewards for first-time users and are looking forward to your financial growth with us.\n\nAt Crypto Dispensers, we are committed to providing not just superior customer service but also an environment where our users can feel confident about their cryptocurrency investments. Your feedback reaffirms our commitment to delivering quality service and value to all our customers.\n\nWe are excited that you've chosen us to embark on your cryptocurrency journey, and we are just as eager to see your investments flourish. Remember, we are here to support you every step of the way, whether you have questions about your account or need insights into new opportunities within the crypto market.\n\nThank you once again for your trust and for sharing your positive experience. We look forward to continuing to serve you and to helping you watch your $$ grow. Your success is our success, and we are excited about what the future holds for you and all our Crypto Dispensers community members.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Monday, May 6, 2024 at 01:11:24 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "letrece gillett",
        "localisation": "US",
        "Titre": "Very professional and easy to use",
        "commentaire": "Very professional and easy to use , reliable agents who respond in a timely matter, with detailed personal responses. Would recommend to anyone 10/10.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Letrece,\n\nWe are thrilled to receive your five-star review and deeply appreciate your kind words about Crypto Dispensers. Hearing that you found our platform professional, easy to use, and our customer service agents reliable and responsive is incredibly rewarding. Our team strives to provide a seamless and supportive experience, and your feedback affirms that we are achieving this goal.\n\nYour mention of the detailed, personal responses from our agents highlights our commitment to not just meet, but exceed, the needs of our users. We understand that the world of cryptocurrency can be complex, and we're here to make it as accessible and straightforward as possible.\n\nThank you also for recommending us with such high praise. A 10/10 rating is a significant endorsement, and it encourages us to continue improving and maintaining the high standards that you and all our users expect.\n\nWe look forward to continuing to serve you and anyone you recommend to Crypto Dispensers. If there's ever more we can do to assist or enhance your experience further, please do not hesitate to reach out. Your satisfaction and trust in our services are what drive us forward.\n\nThank you once again for choosing Crypto Dispensers and for being such a valued part of our community. We are excited to continue supporting your journey in the cryptocurrency world.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, May 8, 2024 at 04:36:27 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Jacob Garcia",
        "localisation": "US",
        "Titre": "Simple, convenient, and great service!",
        "commentaire": "Crypto Dispensers is fairly simple and a convenient way to purchase cryptocurrency, especially if you are new to crypto and want to get started asap. One of the best features they have is being able to turn physical cash into readily available funds in your account that can be used to buy Bitcoin! I also would like to mention that when I was inconveniently blocked from being able to access my account, crypto dispensers helped me obtain access to my account again w/o hesitation! I am extremely grateful to their service and plan to use them in the near future, as well as refer my friends.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Jacob,\n\nThank you so much for your enthusiastic review of Crypto Dispensers! We are thrilled to hear that you found our platform simple, convenient, and service-oriented. It’s great to know that our efforts to make cryptocurrency accessible, especially for newcomers, are resonating with our users.\n\nYour appreciation for the feature that allows you to turn physical cash into funds in your account for purchasing Bitcoin highlights one of the key benefits we strive to offer. This functionality is designed to bridge the gap between traditional and digital finance, making the world of cryptocurrency more accessible to everyone.\n\nWe're also pleased to learn about your positive experience with our customer support team during the time you were blocked from accessing your account. We understand how critical it is to have reliable support in such situations, and we're glad we could assist you without hesitation.\n\nYour plans to continue using our services and to refer friends are the highest compliments we could receive. Referrals from satisfied customers like you help us grow and improve, ensuring we can continue to provide excellent service to the community.\n\nThank you once again for choosing Crypto Dispensers and for taking the time to share your positive experience. We look forward to serving you and your friends in the future, and we are here to support your cryptocurrency journey every step of the way.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, May 8, 2024 at 04:46:14 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Kyndal Fletcher",
        "localisation": "US",
        "Titre": "Fast and efficient service",
        "commentaire": "Fast and efficient service. Very helpful!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Andrew Simpson",
        "localisation": "US",
        "Titre": "So as figured was emailed by then…",
        "commentaire": "So as figured was emailed by then stating that this wouldn't happen again as far as my transactions failing and another emailing me to please retract my review so I gave it some thought and tried their service once more and wouldn't ya know Same thing happened been four hours now and still can't complete my transactions can't reach customer service via email nor phone not a good place maybe one day it will be but as of now my review stays at a star because negative wasn't an option",
        "nombre_reviews": "1 review",
        "date_experience": "4 reviews",
        "reply": {
            "reply_text": "Dear Andrew Simpson,\n\nWe are genuinely sorry to hear about your continued dissatisfaction and the issues you've encountered with your transactions. At Crypto Dispensers, we take every customer's feedback seriously and strive to resolve any issues promptly and efficiently.\n\nWe understand the frustration that can arise from transaction delays. The situation you experienced was due to an unusually high demand for Bitcoin over the recent weekend, which temporarily depleted our available reserves. While we anticipate and plan for fluctuations in demand, this instance exceeded our expectations and affected our ability to immediately fulfill all transactions.\n\nPlease rest assured that our team acted swiftly to replenish our Bitcoin supply to ensure that transactions could be completed without further delay. We regret that this did not resolve your situation more quickly and understand why this has been a source of significant frustration for you.\n\nRegarding your difficulty in reaching our customer service, we are taking measures to improve our response times and availability. Our goal is to be readily accessible to all our customers, and we fell short in this instance.\n\nWe respect your decision to express your dissatisfaction through your review. While we do not agree with the characterization of the situation, we recognize your right to share your experience. At Crypto Dispensers, we are committed to learning from each interaction and feedback, as they are crucial in helping us improve.\n\nOnce again, we apologize for the inconvenience and disappointment you've experienced.\n\nSincerely,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Monday, May 6, 2024 at 01:09:49 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "customer",
        "localisation": "US",
        "Titre": "I good platform to use to buy bitcoin with!",
        "commentaire": "It took a while but I got my account unlocked and am happy because I like this company is easy to use to add money and buy Bitcoin.",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Dear Customer,\n\nThank you for sharing your experience with Crypto Dispensers. We're delighted to hear that you find our platform a good choice for buying Bitcoin and appreciate your patience and understanding while we worked to unlock your account.\n\nIt's great to know that you value the ease of adding money and purchasing Bitcoin through our platform. At Crypto Dispensers, we strive to make every aspect of the cryptocurrency transaction process as simple and user-friendly as possible. We understand the importance of having a reliable platform that not only meets but exceeds your expectations.\n\nWe apologize for any inconvenience you experienced during the account unlocking process. We are continuously working to enhance our security measures and customer support response times to ensure that such issues are resolved more swiftly in the future.\n\nThank you once again for choosing Crypto Dispensers and for your continued support. Your feedback is invaluable to us as it helps us improve and provide better services to our community. We look forward to serving you further and helping you with all your cryptocurrency needs.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Wednesday, May 8, 2024 at 04:54:01 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Beau Saperstein",
        "localisation": "US",
        "Titre": "My first experience using this company…",
        "commentaire": "My first experience using this company was absolutely horrific however recently they restructured and they reached out and they're asking for a second chance which is pretty cool I was banned after being unhappy that product I purchased was not available but I had no refund options I just had to wait it took maybe 12 to 24 hours but I got it as well as a bonus so that was cool. However the transparency that they're showing now is awesome and I love to give dogs haircuts",
        "nombre_reviews": "1 review",
        "date_experience": "7 reviews",
        "reply": {
            "reply_text": "Dear Beau,\n\nThank you so much for your five-star review and for giving us the opportunity to make things right. We are thrilled to hear that our recent efforts to enhance transparency and improve our service have resonated with you. It's important to us that we learn from our past and continuously strive to better our customer experience.\n\nWe deeply regret the initial issues you encountered with the availability of the product and the delay in resolution. We understand how frustrating that can be, and it's situations like yours that have driven us to improve our processes and customer communication. It's heartening to know that, despite the rocky start, the resolution and the bonus you received were to your satisfaction.\n\nYour willingness to give us a second chance and acknowledge the changes we've made means the world to us. We are committed to maintaining this new level of transparency and customer focus, ensuring that all our users feel valued and well-served.\n\nWe also couldn't help but smile at your mention of giving dogs haircuts—a wonderful reminder of the diverse interests and personalities that make our community so special. It's users like you who enrich our community and inspire us to keep improving.\n\nThank you once again for your review and for your continued support. We look forward to serving you better each time and are here to assist you whenever you need us. Your trust and satisfaction are our top priorities.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, April 23, 2024 at 07:53:58 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Corey Persky",
        "localisation": "US",
        "Titre": "A great new option to purchase my Crypto",
        "commentaire": "I was driving home earlier today searching for a Bitcoin ATM and somehow I found a link for CryptoDispensers. It sounded like it possibly was too good to be true. They were offering $25 worth of free Bitcoin on your first deposit of $20 USD or more. With that information, I immediately opened an account with them. Went through the usual KYC (Know Your Customer), and before I knew it, I was at my closest CVS, making my first deposit of $250. I immediately received an email that the funds were in my account. I will definitely be using Crypto Dispensers from now on.",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": {
            "reply_text": "Dear Corey Persky,\n\nYour review has truly brightened our day! We're thrilled to hear about your positive experience discovering and using Crypto Dispensers for the first time. Welcome to our community, and thank you for sharing your journey with us and others considering taking the leap into the world of cryptocurrency.\n\nFinding us while searching for a Bitcoin ATM and deciding to give our platform a try is a story we're excited to be a part of. We understand the hesitance that can come with trying something new, especially when it sounds too good to be true. That's why we're committed to transparency and providing real value to our users, including our $25 worth of free Bitcoin offer for first deposits of $20 USD or more. It's wonderful to know that this offer played a significant role in your decision to join us.\n\nWe're delighted that your initial deposit at CVS was not only successful but also efficiently added to your account, reflecting the seamless and user-friendly experience we strive to provide. Our goal is to make purchasing crypto as straightforward and accessible as possible, and it sounds like we were able to achieve that for you.\n\nHearing that you plan to continue using Crypto Dispensers is the best feedback we could ask for. We're here to support your crypto journey every step of the way, from making deposits at convenient locations like CVS to exploring new ways to engage with digital currencies.\n\nThank you once again for choosing Crypto Dispensers and for taking the time to share your experience. Your trust in us is greatly appreciated, and we're excited to have you as part of our growing community. We look forward to being your go-to platform for all your cryptocurrency needs.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Thursday, March 21, 2024 at 02:14:20 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Mohammad Jamal",
        "localisation": "US",
        "Titre": "i have one suggestion",
        "commentaire": "i have one suggestion, you should also accept 3rd party credit card for payments as well.\nsince some time, 3rd party can not be avtive in systems them self or for any other reasons.",
        "nombre_reviews": "1 review",
        "date_experience": "7 reviews",
        "reply": {
            "reply_text": "Dear Mohammad Jamal,\n\nThank you for taking the time to share your suggestion with us. We're always looking for ways to enhance our platform and make our services more accessible to our users. Hearing directly from our community is invaluable in this endeavor, and we truly appreciate your feedback.\n\nRegarding the acceptance of third-party credit cards for payments, we understand the convenience and flexibility this could offer. However, our commitment to security and compliance necessitates stringent measures to protect our users from potential fraud and misuse. Accepting third-party credit cards presents significant risks that could compromise the integrity of transactions and the safety of our community.\n\nWe strive to balance accessibility with the highest security standards, ensuring that every transaction on our platform is both safe and compliant with regulatory requirements. This commitment sometimes means we must limit certain payment methods, but please know that these decisions are made with our users' best interests at heart.\n\nWe are continuously exploring new and secure payment options that align with our safety and compliance standards. Our goal is to offer a variety of payment methods that cater to our users' needs while maintaining the security and integrity of our platform.\n\nMohammad, your engagement and willingness to offer suggestions are what help us grow and improve. We're grateful for your support and understanding as we navigate these complex issues. Please keep the feedback coming, and know that we're here to provide assistance and answer any questions you may have.\n\nThank you again for choosing Crypto Dispensers and for being a valued member of our community. We look forward to continuing to serve you with the high standards of safety and convenience you expect from us.\n\nWarm regards,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Thursday, March 21, 2024 at 02:15:23 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Patricia Trapasso",
        "localisation": "US",
        "Titre": "Great Customer Service and easy website",
        "commentaire": "Their website is very easy to use and purchases of coin goes very smoothly. Rather than dealing with these a big crypto sites that make it sound like they have it all together but offer no phone number and it takes forever to hear back with problems (I've dealt with many) - I'll take Crypto Dispensers anytime because even the owner, is hands on if there's any issues. Not only do they offer email from my account but also have a Customer Service phone number answered by a real HUMAN! I have run into an issue or two but their Customer Service is very responsive and is on it, resolving the problem right away. I suggest you give them a try because they are so good that you'll never consider buying coin anyplace other than Crypto Dispensers! These people really care about their customers!",
        "nombre_reviews": "1 review",
        "date_experience": "4 reviews",
        "reply": {
            "reply_text": "Dear Patricia,\n\nWe are immensely grateful for your glowing review and the time you've taken to share your experience with Crypto Dispensers. Hearing that you found our website user-friendly and our coin purchase process smooth fills us with pride and joy.\n\nYour comparison with larger crypto platforms and recognition of our unique approach to customer service truly highlights what we aim to achieve - a personalized, accessible, and responsive service for every user. We believe that being available and responsive to our users' needs sets us apart in the bustling world of cryptocurrency.\n\nWe're particularly touched by your appreciation for our hands-on approach, including the involvement of our owner in resolving any issues. Our commitment to providing real human customer service, be it through phone support or email, stems from our core belief that every user deserves to feel supported and valued.\n\nYour experiences, especially in overcoming the few issues encountered, underscore our dedication to resolving problems promptly and efficiently. We're here not just to offer a platform for buying coins but to ensure that each interaction with us is positive, supportive, and satisfactory.\n\nWe're honored by your recommendation and thrilled that you consider Crypto Dispensers as your go-to place for buying coins. Your endorsement means the world to us and motivates us to maintain and exceed the high standards we've set.\n\nPlease know that we are here for you, always ready to assist, support, and grow together in this exciting crypto journey. Your satisfaction and trust in us are what drive us to keep improving every day.\n\nThank you once again for choosing Crypto Dispensers and for being such a valued member of our community. We look forward to continuing to serve you and to always being your preferred choice for all things crypto.\n\nWarmest regards and deepest gratitude,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, March 5, 2024 at 07:51:15 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Sam",
        "localisation": "US",
        "Titre": "I found the website easy to use",
        "commentaire": "I found the website easy to use. Quick sign up process and works with any Bitcoin wallet. Referral bonus is awesome and I love how fast customer service responds if I have a question. I recommend for the new user!!!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Sam,\n\nWe are absolutely delighted with your five-star review and grateful that you took the time to share your experience with Crypto Dispensers. Hearing that you found our website easy to use, along with the quick sign-up process and compatibility with any Bitcoin wallet, truly warms our hearts.\n\nOur aim has always been to create an accessible and user-friendly platform that caters to the needs of both seasoned crypto enthusiasts and newcomers alike. It's rewarding to know that features like our referral bonus and the responsiveness of our customer service team have made a significant positive impact on your experience.\n\nYour recommendation, especially to new users, is the highest praise we could receive. It reinforces our commitment to providing a service that not only meets but exceeds the expectations of our community. We're here to support every user's journey into the world of cryptocurrency, making it as smooth and enjoyable as possible.\n\nPlease know that we're continuously working on enhancing our platform and services based on feedback from our valued users like you. Your satisfaction is our top priority, and we're always here to answer any questions and assist with any concerns you might have.\n\nThank you once again, Sam, for choosing Crypto Dispensers and for your enthusiastic recommendation. We're honored to have you as part of our community and look forward to continuing to serve you with excellence.\n\nWarm regards and deepest gratitude,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, March 5, 2024 at 08:19:36 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Wilson Thomas",
        "localisation": "US",
        "Titre": "Using Crypto Dispensers' CDReload…",
        "commentaire": "Using Crypto Dispensers' CDReload service has been a revelation for me. It's the perfect solution for buying Bitcoin with cash. I love the convenience of topping up my account at familiar retail stores like CVS Pharmacy, Rite Aid, Casey’s, and many more. Not only is the process incredibly user-friendly, but the rates are also notably more affordable than Bitcoin ATMs – almost half the cost! It genuinely feels like having a portable Bitcoin ATM right in the palm of my hand. If you're looking for a seamless, cost-effective way to delve into the world of cryptocurrency, CDReload is the way to go!",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": {
            "reply_text": "Dear Wilson,\n\nA heartfelt thank you for taking a moment to share your positive experience with CDReload by Crypto Dispensers on this platform. Each review we receive, especially as comprehensive as yours, is a testament to our commitment and mission in bringing cryptocurrency closer to our community.\n\nIt's truly uplifting to hear that the convenience and affordability of our service resonated so well with you. From the very beginning, our vision has been to bridge the gap between the complex world of cryptocurrencies and everyday users. Offering a service that feels like having a \"portable Bitcoin ATM\" right at your fingertips is a realization of that dream, and we're glad you're reaping the benefits.\n\nYour comparison of our rates to Bitcoin ATMs and your appreciation of the seamless process echo what we aim to provide – a user-centric approach to cryptocurrency. Our collaborations with familiar retail chains, like CVS Pharmacy, Rite Aid, Casey’s, and more, are all driven by the motive of integrating cryptocurrency into familiar terrains for our users.\n\nIn a constantly evolving digital space, we understand the significance of trust and reliability. Your endorsement is a significant boost to our team, motivating us to push the boundaries further in service delivery and innovation.\n\nRemember, our journey together doesn’t stop here. If you've loved our platform, do consider sharing it with friends and acquaintances. Our referral program is crafted to ensure that when you bring others into our community, you too are aptly rewarded, aligning with our belief in collective growth.\n\nTo conclude, we'd like to express our gratitude for having you as a cherished member of the Crypto Dispensers community. We're not just here to facilitate transactions but to accompany you on your larger journey in the cryptocurrency realm.\n\nA massive thank you once again for your trust and your uplifting feedback. Here's to countless more fruitful exchanges in the future.\n\nWarmest regards,\nThe Crypto Dispensers Team",
            "reply_date": "Tuesday, October 31, 2023 at 03:49:58 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Carol Johnson",
        "localisation": "US",
        "Titre": "4 YEARS JOURNEY & COUNTING.......",
        "commentaire": "crypto dispensers is the best place to buy crypto and I can't wait for them to have USDT and Ethereum on board for trading. I have been a customer of crypto dispensers since 2020 and i've been enjoying their services. are there some days which I feel are bad? yeah there are few times due to maybe system downtime or customer service help and yes they're prompt in resolving any issues you may be having.\nif you want to start a journey with cryptocurrency investment then you just found the right place to do that as it makes it so seamless to access cryptocurrencies with cash at the CDreload and now that they have added the features of debit/credit card transaction, it's another milestone achievement towards their dedication to their services.\nI would like to make a few little suggestions which i feel may be helpful to their customers. it's about the daily limit on the CDrelaod if it can be reviewed and as well the barcode deposit limit also. there should be increase in the daily limit of certain customers and it would be more easier if someone can make large deposit on the barcodes at once like lets say $2000 as it saves time instead of having to be creating barcode for each deposits and having to wait till next day before another deposit could be made. also, I would suggest if crypto dispenser could have a medium for live chat to their CSR so as to be able to instill more confidence in their customers and potential customers. Thank you.\nthough crypto dispensers remains my go to for my crypto asset as it's very easy and seamless to buy with their services. I wish i can give more than 5 stars\n\nCryptoDispensers the best to ever be and the best that will ever be.",
        "nombre_reviews": "1 review",
        "date_experience": "7 reviews",
        "reply": {
            "reply_text": "Dear Carol,\n\nWe're incredibly moved by your detailed review and heartfelt endorsement of Crypto Dispensers as we celebrate four years of our journey together. Hearing about your positive experiences and ongoing support since 2020 truly makes all our efforts worthwhile. Your enthusiasm for the addition of USDT and Ethereum to our platform is shared by our team, and we're excited about the possibilities these offerings will bring to our community.\n\nYour acknowledgment of our commitment to resolving issues promptly, despite the occasional system downtime or customer service challenges, is deeply appreciated. We understand the importance of reliability and responsiveness in our industry, and we're constantly striving to enhance our services to meet and exceed your expectations.\n\nThe introduction of debit/credit card transactions alongside our CDReload service marks a significant milestone in our mission to make cryptocurrency access as seamless and convenient as possible. We're thrilled to hear that these developments have made a positive impact on your cryptocurrency journey.\n\nYour suggestions regarding the review of daily limits on CDReload and barcode deposit limits are invaluable. We are always looking for ways to improve and adapt our services to better suit the needs of our customers. The idea of increasing daily limits for certain customers and allowing larger single deposits is something we will certainly consider to streamline the deposit process further.\n\nAdditionally, the suggestion to introduce a live chat feature for immediate assistance resonates with us. We understand the importance of instilling confidence and providing reassurance to our customers and potential customers. Rest assured, we are exploring ways to implement more direct and efficient communication channels, such as live chat, to enhance our customer service experience.\n\nThank you for your kind words and for choosing Crypto Dispensers as your go-to platform for cryptocurrency assets. Your wish to give more than five stars is the highest compliment we could receive, and it motivates us to continue innovating and providing the best possible service.\n\nCrypto Dispensers aims to be not just the best in the present but to continue setting the standard for excellence in the future. Your feedback and suggestions play a crucial role in this journey, and we're grateful for your engagement and loyalty.\n\nHere's to many more years of seamless cryptocurrency transactions and to continuously improving together. Thank you once again for being an integral part of the Crypto Dispensers family.\n\nWarm regards and deepest gratitude,\nThe Crypto Dispensers Team",
            "reply_date": "Saturday, April 6, 2024 at 02:01:59 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "DAN ADAMSON",
        "localisation": "US",
        "Titre": "A novice user commentary",
        "commentaire": "Was easy to use even for the first time enrolling in & using the platform. And especially easy for someone like me that knows & understands little about the crypto & bitcoin world.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Dan,\n\nThank you so much for taking the time to leave us this wonderful review. We're absolutely delighted to hear that you found our platform easy to use, even as a novice user in the crypto and Bitcoin world. At Crypto Dispensers, we strive to create an accessible and user-friendly environment for everyone, regardless of their prior knowledge or experience with cryptocurrency.\n\nYour feedback is incredibly important to us as it reaffirms our commitment to simplifying the complex world of digital currencies. We believe that everyone should have the opportunity to explore and participate in cryptocurrency, and it's heartening to know that our platform has served as a bridge for you into this fascinating space.\n\nWe're continuously working on improving our platform to ensure that users like yourself can not only get started easily but also continue to learn and grow their understanding of cryptocurrencies in a supportive environment. Your positive experience motivates us to keep pushing the boundaries of what we can offer.\n\nShould you have any questions as you continue your journey with us, or if there's anything specific you'd like to learn more about, please don't hesitate to reach out. Our customer support team is here to assist you every step of the way.\n\nThank you once again for choosing Crypto Dispensers and for sharing your experience. We're thrilled to have you as part of our community and look forward to supporting you as you explore the exciting possibilities within the crypto and Bitcoin world.\n\nWarm regards and heartfelt thanks,\nThe Crypto Dispensers Customer Care Team",
            "reply_date": "Tuesday, March 5, 2024 at 07:49:50 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Xavier Rodriguez",
        "localisation": "US",
        "Titre": "I've sent hundreds of phone calls and…",
        "commentaire": "I've sent hundreds of phone calls and emails ABSOLUTELY ZERO RESPONSE! THIS IS AN EMERGENCY AND I NEED MY MONEY! I am disgusted absolutely appalled that they don't answer anyone at all!\nI needd to send btc after depositing at cvs and over and over failed transaction! Please help!\n\n\n07/24/2023 UPDATE STILL NO WORD FORM ANYONE AND NO WAY TO FIX ISSIE. SCAMMED",
        "nombre_reviews": "1 review",
        "date_experience": "4 reviews",
        "reply": {
            "reply_text": "Dear Xavier,\n\nThank you for sharing your concerns with us on Trust Pilot. We deeply regret to hear about the difficulties you've encountered with our service. Please accept our sincerest apologies for the inconvenience you've had to go through.\n\nWe acknowledge that the lack of response to your numerous phone calls and emails is unacceptable and far from the high level of customer service we aim to provide. This is a crucial area for us to address and we assure you that we are treating this with the utmost seriousness.\n\nWith regard to the failed Bitcoin transaction following your deposit at CVS, we're pleased to inform you that you can now use your CDReload balance to purchase Bitcoin directly.\n\nIn light of your experience, we are committed to revisiting our customer service processes and improving communication with our valued customers. We assure you that Crypto Dispensers is not a scam and we deeply regret any impression that might have been\nconveyed.\n\nWe want to reassure you that your funds are safe and we're working diligently to resolve your issue. Your patience during this time is greatly appreciated and we hope to resolve this for you as soon as possible.\n\nOnce again, we apologize for the distress caused. If you have any further issues or queries, we encourage you to reach out to our dedicated customer service team who will be more than happy to assist you.",
            "reply_date": "Tuesday, July 25, 2023 at 03:16:22 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Linda Osburn Carducci",
        "localisation": "US",
        "Titre": "Almost 5 Stars....",
        "commentaire": "I would have given a 5 Star review if it hadn't taken 9 days to get a Buy accomplished.\nI appreciate being responded to and kept informed as you worked through the banking issues.\nI hope it continues to be a good experience for us both.\nThe site is easy to use and the process is easy to follow.",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": {
            "reply_text": "Dear Linda,\n\nThank you for taking the time to leave us a 4-star review. We're pleased to hear that you found our site user-friendly and the process straightforward. Your appreciation of our efforts to keep you informed during our recent banking issue means a lot to us.\n\nWe understand that the 9-day wait for your Buy transaction to be accomplished was less than ideal, and we sincerely apologize for any inconvenience this may have caused. Our goal at Crypto Dispensers is always to provide a seamless and efficient service, and we regret that we fell short of this in your case.\n\nYour experience has been invaluable in highlighting areas where we can improve. We are continuously working to enhance our processes to ensure faster and more reliable transactions for our customers. We're committed to making your experience with us a 5-star one in the future.\n\nWe’re grateful for your patience and understanding as we navigated through the banking challenges. It's heartening to know that our communication during this time was helpful to you. We aim to maintain this level of transparency and responsiveness as we move forward.\n\nThank you again for choosing Crypto Dispensers. We are encouraged by your hope for a continued good experience and are dedicated to making that a reality. We look forward to serving you better in your future interactions with us.\n\nWarm regards,\nCustomer Care Team, Crypto Dispensers",
            "reply_date": "Thursday, November 30, 2023 at 07:15:30 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "Music Nation Gh",
        "localisation": "US",
        "Titre": "THIS SITE IS A HELL OF A SCAM",
        "commentaire": "THIS SITE IS A HELL OF A SCAM,THEY BLOCKED MY ACCOUNT WITH BALANCE IN IT AND NO ONE IS RESPONDING TO ME,I GOT HOLD OF THE CEO FIRAS ISA AND HE READ MY COMPLAINS AND IGNORE IT AND EVEN BLOCKED ME AFTER READING MY MESSAGES AND MY ACCOUNT IS STILL BLOCKED TILL NOW GUYS....THEY SCAMMED ME,STOP USING THIS WEBSITE THEY'RE SCAMMER LET'S JOIN HANDS AND BRING THEM DOWN.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Music Nation Gh,\n\nThank you for taking the time to share your feedback on Trustpilot. At Crypto Dispensers, we take all customer concerns seriously, and I want to personally address the issues you've raised.\n\nFirstly, we deeply regret any distress caused by the temporary blocking of your account. We understand how concerning this must be for you, and we apologize for the lack of communication you've experienced. Please be assured that our primary goal is to ensure a secure and trustworthy environment for all our customers.\n\nIn line with our commitment to security, we periodically review accounts to uphold our stringent standards. This process is crucial in maintaining the integrity of our platform and protecting all our users. While we cannot disclose specific details in a public forum, we want to reassure you that such measures are standard practice and not indicative of any presumption regarding individual users.\n\nWe acknowledge that the communication regarding your account could have been more transparent and empathetic. We are taking steps to improve our responsiveness and clarity in customer interactions. Your experience has highlighted the need for this and we are committed to making these improvements.\n\nAs a valued user since 2021, your relationship with Crypto Dispensers is important to us. We are currently reviewing your situation and will reach out to you directly with more information as soon as possible. We appreciate your patience during this process.\n\nOur team is dedicated to providing a fair and secure platform for all our customers. We hope to resolve this matter in a way that restores your confidence in our services. Please feel free to reach out to our customer support for any further assistance or concerns you may have.\n\nThank you again for your feedback. It is crucial in helping us enhance our services and ensure a positive experience for all our users.\n\nWarm regards,\nCustomer Care Team, Crypto Dispensers",
            "reply_date": "Thursday, November 30, 2023 at 10:50:09 PM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "customer",
        "localisation": "US",
        "Titre": "This website is very problematic",
        "commentaire": "This website is very problematic. It's always working just fine until you deposit your money. A minute after my money is deposited into the account then an error message pops up saying they're having technical difficulties, which means you can't use your money for over 12 hours! If your website doesn't work, warn customers before they deposit. This has happened so much it seems like I'm being scammed out of my money. I send support tickets. No one ever responded to my concerns either.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear Customer,\n\nThank you for your review. We are sorry to hear that you have had such a negative experience with our website. Our technical team is constantly working to improve the stability of our platform and we apologize for any inconvenience this may have caused you. If you would like to speak to someone about this issue, please feel free to contact our support team at any time. Thank you for your feedback and we hope that you will give us another chance in the future.",
            "reply_date": "Thursday, November 17, 2022 at 12:36:11 AM"
        }
    },
    {
        "company_name": "Crypto Dispensers",
        "User": "John Smith",
        "localisation": "US",
        "Titre": "I deposited $500 to my account and they…",
        "commentaire": "I deposited $500 to my account and they are not letting me withdraw my Bitcoin. Transaction id is vpAOK4. I will be posting about this daily until their site is offline or I get my Bitcoin.\n\nEdit: they replied to me saying their cash to crypto service was new, but they made this reply to someone else:\n\n\"We would like to assure you that we have been successfully operating as a reputable cash-to-cryptocurrency exchange since 2017. \"",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Dear John,\n\nWe are sincerely sorry to hear about the issues you've experienced with our service and for the inconvenience this has caused you. Your satisfaction is very important to us, and we deeply regret the problems you've had.\n\nWe were recently encountering technical difficulties that affected certain transactions, which could be the reason behind the difficulty you faced with your withdrawal. I am pleased to inform you that these technical issues have now been resolved.\n\nYou can go ahead and try processing your transaction with the ID vpAOK4 now. We trust it should proceed without any further issues.\n\nPlease understand that CDReload is a new service which we are constantly striving to improve every day. While we are working hard to ensure seamless transactions, there may be occasional bumps along the way, and we appreciate your patience and understanding during this period.\n\nWe apologize once again for the inconvenience and delay you had to experience. If you have any further issues or questions, please feel free to contact us. We're here to assist you and ensure your experience with us is satisfactory.\n\nBest Regards,\nThe Crypto Dispensers CDReload Customer Support Team",
            "reply_date": "Wednesday, May 31, 2023 at 07:17:34 PM"
        }
    },
    {
        "company_name": "Swadesh",
        "User": "Eric Low",
        "localisation": "US",
        "Titre": "International transactions",
        "commentaire": "Very easy to do cross border transactions - thanks :)",
        "nombre_reviews": "2 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Hamza masood",
        "localisation": "PK",
        "Titre": "Swadesh is a good app safely and truly…",
        "commentaire": "Swadesh is a good app safely and truly app this app is a expensive earning for you thanks.",
        "nombre_reviews": "2 reviews",
        "date_experience": "6 reviews",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Abdulaziz Aliye",
        "localisation": "ET",
        "Titre": "Because",
        "commentaire": "I'm poor people help me",
        "nombre_reviews": "2 reviews",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Nagaraju Doddasomanahalli",
        "localisation": "IN",
        "Titre": "Cross border payments",
        "commentaire": "Transferred regular amounts from US to India for over a month, I did not face any major issues.",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Vignesh N Shetty",
        "localisation": "IN",
        "Titre": "Cool Benefits",
        "commentaire": "Just downloaded the app to manage my expenses in the US but got a lot more benefits than what I expected.",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Harsh Vardhan Singh",
        "localisation": "IN",
        "Titre": "Best banking app for Indian internationals",
        "commentaire": "It took my less than 15 minutes to download and get a US bank account! The customer support is really nice as well",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Roopa DN",
        "localisation": "IN",
        "Titre": "Banking in the US",
        "commentaire": "Day to day transactions were much easier to manage with Swadesh.",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Hemanth Gowda",
        "localisation": "IN",
        "Titre": "Made for Indians in the US",
        "commentaire": "Best app for managing finances for students/ professionals in the US",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Singhmahesh Nayak",
        "localisation": "IN",
        "Titre": "Working experience is 4years",
        "commentaire": "Useful",
        "nombre_reviews": "2 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Swadesh",
        "User": "Suhas Sharade",
        "localisation": "IN",
        "Titre": "Swadeshi Feels",
        "commentaire": "Easy UI. Very helpful",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "The Payment HQ",
        "User": "Jay Dankha",
        "localisation": "US",
        "Titre": "Best Merchant Ever",
        "commentaire": "Since day 1 Cesario has been our local rep and has been there every step of the way to help me whenever I needed. The Payment HQ is the best merchant services and most trustworthy company I have dealt with. They support my industry which is considered high risk and made it very easy to get me an account approved. Besides getting an account approved and processing without issue, they also had a large catalog of terminal and point of sale solutions to select from. The point-of-sale system Cesar recommended to invest in has helped save me countless hours of inventory management. You get great customer service and options to select what’s best for your business. I absolutely enjoy working with The Payment HQ and of course their best rep Cesario.\nThank you Cesario & The Payment HQ for supporting my business.\n\nAdam's Ave Smoke Shop",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you Jay for sharing your positive experience working with us! Getting high risk account approved and processing seamlessly is our specialty. We are very happy to hear that you are loving your new point of sale system and that it has helped improve how you run your business. You are in good capable hands with Cesario and we look forward to being of service to you for many years to come!",
            "reply_date": "Thursday, October 19, 2023 at 09:40:53 PM"
        }
    },
    {
        "company_name": "The Payment HQ",
        "User": "Aqua Fix Water Store",
        "localisation": "US",
        "Titre": "Payment HQ is the best Merchant…",
        "commentaire": "Payment HQ is the best Merchant Services out there!, not only are they local my rep Cesar always goes above and beyond to help my business with support (never switching). Even the supporting reps at Payment HQ are always willing help. The level of treatment and care I receive I can not even being to explain. I truly found a company that cares about my business needs and doesn’t treat me like a number. If you are needing or just looking for a new merchant you must to contact Payment HQ and ask for Cesar!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for sharing your positive feedback! We strive to exceed our customers expectations with a high level of service and care when we are trusted to be your payments provider. Hearing from you let's us know that our training and vision is being honored with our team members.\n\nCesar is one of our top guys and you are in great hands working with him. We are glad to have you as a valued customer and look forward to supporting you in the years to come.\n\nThe Payment HQ Team",
            "reply_date": "Saturday, July 8, 2023 at 04:03:28 PM"
        }
    },
    {
        "company_name": "The Payment HQ",
        "User": "Austin Kruck",
        "localisation": "US",
        "Titre": "I am lucky to work with The Payment HQ!",
        "commentaire": "I am lucky to have had an exceptional experience working with Charles and Giovanni at The Payment HQ. Their team provided top-notch expertise and professionalism throughout the entire process. The platform they offer is user-friendly and robust, delivering seamless and secure solutions. I greatly appreciate their prompt and reliable customer service, always there to assist with any inquiries. I highly recommend The Payment HQ.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Hi Austin,\n\nWe appreciate you sharing your positive experience and letting us know our platform & team is delivering is delivering on its promises.\n\nIt's our goal to ensure our clients and partners have a world class experience working with us and our platform.\n\nWe look forward to being of service and thank you for your business relationship!\n\nThe Payment HQ Team",
            "reply_date": "Friday, June 30, 2023 at 04:09:19 PM"
        }
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Roberto Arcanum Vatical",
        "localisation": "US",
        "Titre": "Bank Trust.",
        "commentaire": "I needed a bank I could trust, with an actual physical location to interact with. Not spending countless hours on the phone just to try to get my money; and they were there when needed. It is great to know some banks still value customer interaction and face to face transactions. In the age when people pretend to be other people, Meriwest provides me ample security, safety, and peace of mind in knowing they can’t be defrauded putting my money in safe hands.",
        "nombre_reviews": "9 reviews",
        "date_experience": "9 reviews",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Randall Hulsey",
        "localisation": "US",
        "Titre": "Horrible Customer Service",
        "commentaire": "I was an almost 30 year client of Meriwest until they upgraded their login system with minimal notification and locked my out of my account. After multiple attempts, I final sent a registered letter to close my account back in March, and have yet to get my money back (now May). They continue to send me e-notices even though I have told them multiple times I can't login (probably telling me about all the fees that they are charging me rather than giving my money back as requested). I suspect I am going to have to get a lawyer involved to get my money back from them.\n\nBottom line: I would bury my money in glass jars in the backyard before I would use Meriwest again. They certainly put profits ahead of customer satisfaction.",
        "nombre_reviews": "9 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Cheryl Brennan",
        "localisation": "US",
        "Titre": "If I could give a -10 I would",
        "commentaire": "If I could give a -10 I would. We have had IBM then Meriwest for over 50 years. The customer service is terrible. After waiting for 45 minutes last week and never getting the escalation callback, I had to wait another 45 minutes today. I cannot log into my on-line account. Their solution - come into a branch. Problem is the closest branch is an eight hour drive. RUN far away from them!",
        "nombre_reviews": "9 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Udgin",
        "localisation": "US",
        "Titre": "As a client of Meriwest Credit Union",
        "commentaire": "As a client of Meriwest Credit Union, I am thoroughly impressed with their overall services. The staff is consistently engaging, professional, and ready to help, which makes for a very positive communication experience.\nTheir credit terms are transparent and easy to understand. This was particularly beneficial when I was looking to finance my automobile purchase. The terms were advantageous, offering great value and fitting well with my financial planning.\nIn summary, Meriwest Credit Union offers not only top-notch service, but also advantageous credit conditions. My experience financing my car through them was seamless and stress-free. I wholeheartedly recommend Meriwest for anyone in need of financial services.",
        "nombre_reviews": "9 reviews",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Bhavana",
        "localisation": "IN",
        "Titre": "It is Good to have this website and…",
        "commentaire": "It is Good to have this website and more usefull.",
        "nombre_reviews": "9 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Инна Губаренко",
        "localisation": "UA",
        "Titre": "Хорошая компания все отлично работает!",
        "commentaire": "Useful",
        "nombre_reviews": "9 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "Apu Raihan",
        "localisation": "BD",
        "Titre": "Very Nice.This is great",
        "commentaire": "Useful\n1",
        "nombre_reviews": "9 reviews",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Meriwest Credit Union",
        "User": "phinan Oeurng",
        "localisation": "KH",
        "Titre": "Give me 200$🙏",
        "commentaire": "Useful",
        "nombre_reviews": "9 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "ASDFTEST",
        "User": "asdf",
        "localisation": "US",
        "Titre": "time for __proto__.asdf",
        "commentaire": "time for __proto__.asdf\nbh",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "WPC Merchant Services & Credit Card Processing",
        "User": "Alex Haile",
        "localisation": "ET",
        "Titre": "I have above 10 years exprince both…",
        "commentaire": "I have above 10 years exprince both commericial bank and abyssinia bank\nIn order to adress all customer using cardeless opration only by right hand thumb or by eye and avaible for all with out asking permission to customer",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM",
        "User": "Elena Dafni",
        "localisation": "GR",
        "Titre": "I don't know much about Cryptocoins!",
        "commentaire": "Useful",
        "nombre_reviews": "2 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM",
        "User": "MelissaAnn",
        "localisation": "US",
        "Titre": "Awful. Scam. BBB rating \"F\"",
        "commentaire": "Purchased $10,200 in bitcoin, never able to move my bitcoin to transfer, or to move to another wallet. Assistance sought, FAKE WALLET! Sought assistance, repeated replies in Russian, I am not able to read or speak Russian--asked for English -- never provided nor replied. Also, repeated pleas for assistance or phone call ignored. Horrible experience",
        "nombre_reviews": "2 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM",
        "User": "Don Buford",
        "localisation": "US",
        "Titre": "25% fees not documented anywhere",
        "commentaire": "25% fees not documented anywhere. Avoid at ALL costs. Will never use this ATM company again.",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM",
        "User": "Daniel Hayslip",
        "localisation": "US",
        "Titre": "This daniel hayslip Becky station Beth…",
        "commentaire": "This daniel hayslip Becky station Beth Jordon cashed checks Becky hayslip Larry hayslip anda clark Candice noes about all on dip rapinig kids and all sick won't them in jail jelyce over phone I have not don non this donnie walkions in on it to ask how howerd merfey Denise fisher getting cards actavated keven marsh and jonny hayslip jonny wilder took cops scaminug linked jimmy station edd scoot charles shorts doughter all in one n stalking kids malisa ricky vangundi noes and fload Carl doughter stalking kuds",
        "nombre_reviews": "2 reviews",
        "date_experience": "6 reviews",
        "reply": null
    },
    {
        "company_name": "Coinhub Bitcoin ATM",
        "User": "Safi Nassir",
        "localisation": "ET",
        "Titre": "Adiss Ababa shager",
        "commentaire": "Ayat Rilestet Apartment",
        "nombre_reviews": "2 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Mukhtar Ya'u",
        "localisation": "NG",
        "Titre": "My app is fell so I want renew",
        "commentaire": "My app is fell I need to renew",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Daniel Hayslip",
        "localisation": "US",
        "Titre": "This daniel hayslip this my account…",
        "commentaire": "This daniel hayslip this my account won't cops to arest them ronda hayslip Ben actavatinug cards Alisa hayslip fload all rapinig mesinug kids and angi",
        "nombre_reviews": "1 review",
        "date_experience": "6 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Thabiso",
        "localisation": "ZA",
        "Titre": "Cash Express has the best services when…",
        "commentaire": "Cash Express has the best services when it comes to their customers.Everything is Easy and Fast compared to other services provided by other organizations.I Trust Cash EXPRESS WHOLE HEARTEDLY",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Ashley Houston",
        "localisation": "US",
        "Titre": "To get my money deposited to a cash app…",
        "commentaire": "To get my money deposited to a cash app so I can get my refund back today actually Ashley Houston Macon Missouri",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Jeanette Reece",
        "localisation": "US",
        "Titre": "Two workers, Two different answers",
        "commentaire": "I went into cash express on Eastern Bypass. I went in early because I got my check early. I ask the girl who waited on me if it would be a problem paying early. She says no, I don't see a problem with it. So I reborrow, after paying. Next month comes and a different girl calls and says I am down to pay that day. I said I don't get my check till the first and the 3rd. She says we'll the 3rd is 4 days out. I said well I get a check the first also and that is 2 days out. She says well your check may be here when you come or it may not be. I said well do what ever you have to but I don't get paid till the first and 3rd. Can come in the first. So today I look at my bank account and sure enough she had turned it in and it's pending. I don't care mind you but the other girl had told me it would be fine. This dark haired girl that called me has always been so hateful. I always avoid having to deal with her and always go to the other register. The black haired girl is a very pretty girl but her attitude and personality and hatefulness does not go with her beauty. But how is one worker saying one thing and another worker saying another helping at all. I been going there for a few years. I will be finding another location. I will go to the one on Main Street. Evidently paying early makes a whole lot of difference.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "THA KAKNEKA. Pss",
        "localisation": "KH",
        "Titre": "Good for saving money",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Joys Verma",
        "localisation": "IN",
        "Titre": "Nice Service",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Nunya Business",
        "localisation": "US",
        "Titre": "They try to bully elderly folks",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Shane Kinney",
        "localisation": "US",
        "Titre": "Shane Kinney",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "N N Colection",
        "localisation": "ID",
        "Titre": "good i like this",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "3 reviews",
        "reply": null
    },
    {
        "company_name": "Cash Express",
        "User": "Pyae Sone Paing",
        "localisation": "MM",
        "Titre": "Good I like it",
        "commentaire": "Useful",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com",
        "User": "Dwight welding pussie",
        "localisation": "US",
        "Titre": "Dwight welding is a bitchhhh asss rep…",
        "commentaire": "Dwight welding is a bitchhhh asss rep who couldn’t help unlock my acct 4405145893 this fuks charge 20$ off every 100$ thieves",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com",
        "User": "Finlay Stewart",
        "localisation": "US",
        "Titre": "I have been using Cryptobase ATM…",
        "commentaire": "I have been using Cryptobase ATM machines for over 3 years now. All of them are safe and secure which makes me feel comfortable using them every time. I appreciate all of their support when I was having trouble with my wallet",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "cryptobaseatm.com",
        "User": "Bailey Horton",
        "localisation": "US",
        "Titre": "Cryptobase is the only name I trust…",
        "commentaire": "Cryptobase is the only name I trust when I am looking to buy crypto currencies like bitcoin with cash. 5 stars without a doubt",
        "nombre_reviews": "1 review",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Meghan Rogers",
        "localisation": "US",
        "Titre": "Highly recommend you DONT do business…",
        "commentaire": "Highly recommend you don’t do business with them. Heritage sent me a letter in the mail about “pre qualification” awesome I’ll give it a go I’ve had my car for some time maybe there’s a lower/better rate. Mark sent me a message after I applied for my refinance that he already had me matched with a few lenders. I mixed up 2 numbers on my application as I have slight dyslexia, he then tells me that everyone has denied my application…after he told me he already had me matched and he was putting numbers together. I fixed the numbers that I had mixed up on my application for him to tell me that they’ll get back but the end of the month is busy for “new applications only” so I may not hear back as quickly as my first application…fine no big deal. It has now been a month. I feel like I’ve been pretty patient and I saw good reviews about the company before I had applied. However, this is just my experience. Take it as you will.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Bill Stahl",
        "localisation": "US",
        "Titre": "Heritage has been amazing",
        "commentaire": "Heritage has been amazing, I live an hour from any office and still will not use anyone but Heritage Valley, I know if I need anything, I can call and get nothing less than professional yet family like assistance,\nHeritage has helped me with everything from my home mortgage to the purchase of my automobile. Thanks",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Bill, thank you for your review, and expressing your satisfaction with our call center. We're glad that we can help you with your mortgage and auto loan too!",
            "reply_date": "Wednesday, September 8, 2021 at 04:28:54 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Jeffrey Gordon",
        "localisation": "US",
        "Titre": "Open a dialog of settlement with Customer…",
        "commentaire": "I have been a customer of HVFCU for over 17 years. When I started to run behind in my credit card payments, instead of contacting me to see if they could negotiate a reason or settlement with me, they opted to sue me. Most companies that care about their customers try to create an open communication to assist when a client falls behind. That is if they really care about their customers.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Nikki Faust Shaffer",
        "localisation": "US",
        "Titre": "I have used HVFCU for decades!",
        "commentaire": "I have used HVFCU for decades! Very helpful and responsive online help. Courteous and friendly tellers. We have had numerous loans through them, car and personal. We also just refinance to a 15 year mortgage. The processes were always very smooth. Would definitely recommend!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for being a long time member, and for leaving an amazing review. We're always happy yo hear how we help our members in all aspects of their financial journey.",
            "reply_date": "Wednesday, September 8, 2021 at 04:31:21 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Dee",
        "localisation": "US",
        "Titre": "Heritage Valley is an amazing company…",
        "commentaire": "Heritage Valley is an amazing company filled with so many helpful people. They helped me consolidate my debt, which helped my credit score increase over time.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for your review. We're always happy to help!",
            "reply_date": "Wednesday, September 8, 2021 at 04:15:23 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Patricia J Carey",
        "localisation": "US",
        "Titre": "Satisfied Long Term Client",
        "commentaire": "I have been a member of Heritage Valley Federal Credit Union for 35+ years. My 3 sons were members since they were children when they had the dinosaur accounts. We love doing business with the credit union. Patricia, Marcus, Michael and Stephen",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Pat, thank you, and your sons for being a long-time members!",
            "reply_date": "Friday, September 10, 2021 at 03:17:08 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Christopher “Chris” Knox",
        "localisation": "US",
        "Titre": "Had a great experience with a Home…",
        "commentaire": "Had a great experience with a Home Equity Loan. It was a super easy and fast process and would recommend them to anyone looking for this type of loan.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you Chris for your review. We are glad that you had a great experience with getting a Home Equity Loan.",
            "reply_date": "Wednesday, September 8, 2021 at 04:16:10 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Jayne",
        "localisation": "US",
        "Titre": "I have been with HVFCU for years",
        "commentaire": "I have been with HVFCU for years! The team is friendly and helpful no matter what your concerns or needs are - loans or account questions are quickly resolved.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for your review Jayne!",
            "reply_date": "Wednesday, September 8, 2021 at 04:26:12 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Cathy Lynn Ziegler",
        "localisation": "US",
        "Titre": "I have been a member for years with…",
        "commentaire": "I have been a member for years with HVFCU and the staff are always smiling & happy to greet you and help you in a way. If I have a problem on line they are quick to fix the problem. I enjoy using their friendly; easy app as well!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for your review Cathy. We're always happy to see your cheerful face too!",
            "reply_date": "Friday, September 10, 2021 at 03:18:01 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "David",
        "localisation": "US",
        "Titre": "Helped Grow My Family & Business!",
        "commentaire": "I have been with HVFCU for many years now. They have helped me grow my family and business alike. From vehicle loans to great rates on business accounts, it has been a great experience from start to current date!\n\nThank you, HV!",
        "nombre_reviews": "1 review",
        "date_experience": "13 reviews",
        "reply": {
            "reply_text": "David, thank you for your five-star review! We appreciate your kind words, and so happy we can help.",
            "reply_date": "Tuesday, September 7, 2021 at 12:18:39 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "DJ",
        "localisation": "US",
        "Titre": "Good for the most part",
        "commentaire": "Good for the most part. Their app / website can be confusing and weird at times.",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you for your review and feedback. If you wouldn't mind sharing some specifics on what is confusing about our app / website, we can address the issue and try to create a smoother experience for you and our other members.",
            "reply_date": "Wednesday, September 8, 2021 at 04:36:17 PM"
        }
    },
    {
        "company_name": "Heritage Valley Federal Credit Union",
        "User": "Jim",
        "localisation": "US",
        "Titre": "We are new to HVFCU",
        "commentaire": "We are new to HVFCU, pleased with their banking.\n\nI also like the free coin counter!",
        "nombre_reviews": "1 review",
        "date_experience": "1 review",
        "reply": {
            "reply_text": "Thank you Jim for your review. The coin counter is a great time saver!",
            "reply_date": "Friday, September 10, 2021 at 03:16:14 PM"
        }
    },
    {
        "company_name": "PNC Bank",
        "User": "Emrah Yilmaz",
        "localisation": "US",
        "Titre": "They will charge you fees no matter what",
        "commentaire": "When you bank with them .I promise ,you feel like they are try to charge you some fees .I was custumer around 10 years ,no benefits,custumer service is 0 🌟 star specially when you talk to them over the phone .they will \"our specialists will contact you \"they won't call you ,text you or e mail or mail.they will send you offers if you do big deposits over 50k or something. Custumer service treatments depends on your accent ( immigrants background)in eastville ,virgina branch.",
        "nombre_reviews": "17 reviews",
        "date_experience": "17 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Mark",
        "localisation": "US",
        "Titre": "They supposed to put a stop payment on…",
        "commentaire": "They supposed to put a stop payment on my card they did it and still charged me the $33 said they wasn't going to put my account negative.. I got a $53 deposit and now they're going to take that money and not fix my money and I try to tell the representative my problem and she hung the phone up on me!!! I will sue PNC Bank. Even for $53.",
        "nombre_reviews": "17 reviews",
        "date_experience": "10 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Consumer",
        "localisation": "US",
        "Titre": "The customer service agents are…",
        "commentaire": "The customer service agents are clueless and can’t help at all. Having to go to a branch for an issue is antiquated. The lock my account for smallest reason and then make it impossible to unlock.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Ipi",
        "localisation": "US",
        "Titre": "It's the worst bank ever",
        "commentaire": "It's the worst bank ever. I made an appointment with PNC Bank to open a business account, but nobody was there to help me when I showed up. The person I talked to before didn't tell me it was his last day and that nobody would be there to assist me. It was a big waste of time. The bank didn't tell me the truth, and they didn't care about helping me. It's not right that they didn't inform me about the situation. I'm disappointed with their service. I won't recommend PNC Bank to anyone.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Charisse Anna Streeter-Wenger",
        "localisation": "US",
        "Titre": "Once again PNC online banking is not…",
        "commentaire": "Once again PNC online banking is not working. I am having so many problems with them. I've been with them for 25 years and all the sudden I'm having issues with their biometrics, username, and password. If they don't get their crap together I'm switching banks.",
        "nombre_reviews": "17 reviews",
        "date_experience": "9 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Atira Nolan",
        "localisation": "US",
        "Titre": "Respected customer service",
        "commentaire": "Went in to open account didn't feel very welcomed by Jesus Diaz appears as if he don't like blacks wasn't respected and felt uncomfortable during this visit won't be back if don't like black people he should find another place to work",
        "nombre_reviews": "17 reviews",
        "date_experience": "4 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Daniel Young",
        "localisation": "US",
        "Titre": "I have an investment with PNC that I…",
        "commentaire": "I have an investment with PNC that I took out in 2017 when bank was still BBVA. The investment officer at branch bank in Hurst Texas on Bedford Euless rd was Eddie Gassoway. I had couple of meetings with him about investing $18,000, and expressed to him him that I wanted something safe that would be guaranteed to lose no value, but make me a little over a ten year period. I was just beginning to draw SSA benefits and trying to retire from self employment of 50 years. Eddie talked me into a market indexed CD that at minimum would return me $23,000 at end of ten years. Not good now, but acceptable then. When I got my first six month statement value of CD had dropped to around $17,000, so I went in to talk over with Eddie and he assured me that it just appeared that way, but there had actually been no drop in value. Long story short it's six years later, value of CD is now around $14,000. When I went in about six months ago they told me no worry at end of ten years I would still have my $18,000. I responded that I could have left under mattress for ten years and still had $18,000. At this point no officer at this band will even discuss the investment with me but they do give me an 800 # that I can call. Banked at this branch since 1999 since they were Guarantee, and this is the customer service u get from them. Just closed out personal and business checking accounts on 5/7/24. Looks like I am just going to have to close out CD and take loss of thousands since no one will talk to me from bank. PNC has got to be the pariah of the banking system please don't even consider them",
        "nombre_reviews": "17 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Valerie Bocz",
        "localisation": "US",
        "Titre": "Automation of PNC Bank Feedback",
        "commentaire": "Automation of PNC Bank is a terrible and disturbing trend. No human contact for bad service!\n\nPNC Financial Services CEO William Demchak tells financial analysts PNC Bank is going to \"'change the world\" and \"remove tellers so that we have more automation.\"Today, 90 percent of PNC Bank branches have tellers. In five years, only one-third of them will. Some people are wary of the coming change.",
        "nombre_reviews": "17 reviews",
        "date_experience": "9 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Phil and Jessica Leto",
        "localisation": "US",
        "Titre": "THIEVES AND LIARS…",
        "commentaire": "Was lied to by mortgage sales team to get business. Then condo team missed a contractual deadline and denied a loan. It wasn't my fault, lost my earnest money and they just told me they aren't at fault. Billion dollar a year company can't give a few thousand dollars back to a customer after their sales people lied. SCUM",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Susan Bonner",
        "localisation": "US",
        "Titre": "The waiting for help was awful",
        "commentaire": "The waiting for help was awful and after waiting an hour I couldn’t get an appointment to open up an account for two weeks later so I took my business the same day to FNB and opened up an account right away with no waiting or appointment that day… PNC also wanted to charge me 95.00 dollars to cash a check that they issued… I never will try to do business with PNC again.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Jonathan Okafor",
        "localisation": "US",
        "Titre": "I am dealing with the Pension process…",
        "commentaire": "I am dealing with the Pension process and it has been an absolutely dreadful experience. The process is meant to frustrate and infuriate loved ones just trying to access capital from a loved one that has recently passed. This is just another consistent feedback point that confirms the ruthlessness and human depravity that is rampant at PNC bank.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Nhat Nguyen",
        "localisation": "US",
        "Titre": "Not satisfied with business checking's bogus charges.",
        "commentaire": "I opened a new business checking account on 06/13/2023 for my currently inactive business (while searching for property to lease). The banker told me that there will be no service charges if I maintain a balance of at least $500, but somehow the banker signed me up for Cash Flow and it has taken a charge of $52 every month since then ( I have had a business checking account at Capital One Bank and there are no service charges at all ).Maybe the banker get some extra perks for signing me up for unwanted services without telling me. I have called customer service to cancelled Cash Flow, but they have refused to credit me the charges. I will cancel all of my accounts with PNC bank, as there are a lot decent banks out there.",
        "nombre_reviews": "17 reviews",
        "date_experience": "2 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Ron K",
        "localisation": "US",
        "Titre": "Mixed",
        "commentaire": "Overall experience, not just a recent visit: They are just OK. I haven't had the very negative experiences of some, but (1) their website is poor: difficult to find information; often glitches. (2) their Money Market account paid next to 0% interest in these high rate times, until I presented them evidence of what competitors offer. Even then, it only lasts 6-12 months, at which point I will need to request a rate check again.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Deb",
        "localisation": "NL",
        "Titre": "Satisfied With The Customer Service Today at PNC Bank",
        "commentaire": "I recently stopped by a local PNC Bank Branch and was very satisfied by the awesome customer service that I received from the managers, the personal bankers, and the representatives there. Even by speaking over the phone with the managers along with the bankers from the Irving,Tx Branch locations, the Duncanville, Tx. branch location, and the other branch locations, I could tell that this would be a great place to bank with and also work for, especially for someone seeking long-term employment opportunities. The employees, including the managers seem very patient, thorough, knowledgeable and were able to answer all of my questions and concerns. I am not yet a customer with this banking financial institution yet, but with the excellent customer service that I received today and after communicating with a few of the branch managers, I think that I will soon be banking with PNC Bank.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Luanne Singel",
        "localisation": "US",
        "Titre": "The worst customer service experience…",
        "commentaire": "The worst customer service experience I’ve ever had. My father died six months ago and we’re STILL dealing with PNC’s IRA division. The whole division is incompetent. For some reason it takes mail about THREE weeks to get from Pittsburgh to Northeast Ohio. They don’t use metered mail so who knows when it is actually mailed out. The IRA division will accept emailed, scanned documents but they will NOT send anything via email. We’ve moved our accounts to another bank. You should too.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Andrew Uhrmacher",
        "localisation": "US",
        "Titre": "Give you the run around and lie",
        "commentaire": "Convenient locations but different customer service agents tell you different answers. Spoke with 3 people over the last week of when I should receive my debit card I ordered last Tuesday. The first person said it should only take 5-7 days, the second said 7-10 days and the third said 5-7 days or 7-10 days. But if you look on Google it says 5-7 days. So extremely inconsistent answers to the same, simple question.\nThe second and third customer service agent also tried putting the blame on the post office. But it is PNC's fault for not putting tracking on a debit card being sent through the postal service. The postal service has enough issues but sending a small envelope from the corporate office in either cinncinnati or Cleveland where they process the debit card to just outside of Pittsburgh takes up to 10 days? That's entirely not on the postal service, because you can receive a postal package from California in less then 10 days. That is 100% the responsibility of PNC for sending a debit card that way and giving customers inconsistent answers of how long it should take.\nAbsolutely absurd and disgusting for a debit card to take up to 10 days to be delivered.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Alan Draeden",
        "localisation": "US",
        "Titre": "Seven years and i'm done.",
        "commentaire": "After about seven years with PNC, i'm leaving. They have restricted my spending, they have denied my disputes of scams, and they constantly go down when rent is due. I'm sick of them being unreliable and outright against me. Their new commercials say they are boring? Yes, and they are lazy too. Pick a better bank.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Tetiana Milosevsk",
        "localisation": "US",
        "Titre": "Fraudsters enjoy PNC members' cash for 90 days!",
        "commentaire": "I ordered heart meds which I didn't get by the date that the seller mentioned in their confirmation email.\nHalf a month ago I sent a request to the seller's Help center to refund the transaction and didn't get a response.\nAfter I filled out the form to PNC about a suspicious transaction they answered that the bank would solve the issue in 90 days!!!",
        "nombre_reviews": "17 reviews",
        "date_experience": "10 reviews",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Kimberly Collier",
        "localisation": "US",
        "Titre": "Banker was not kind or understanding",
        "commentaire": "Banker was not kind or understanding. She was more interested in trying to find a scam than she was in helping me set up a small business accout. She went so far as to say scammers loved to target old people. She was nosy and unprofessional.",
        "nombre_reviews": "17 reviews",
        "date_experience": "1 review",
        "reply": null
    },
    {
        "company_name": "PNC Bank",
        "User": "Tracy",
        "localisation": "US",
        "Titre": "I wish I could give a 0-star rating",
        "commentaire": "I wish I could give a 0-star rating. I was scammed which made my account go negative nearly -$4,000. I am unemployed and they insisted I pay back the negative checking account or get sent to collections. I had to take out my IRA to pay them so I don’t lose my excellent credit score when the scam wasn’t even my fault. Everyone I spoke to at PNC was completely rude and did not care about me at all. Immediately find a new bank. ALSO bonus… back when my HUSBAND DIED, I inherited his account. No one told me his account would incur fees if he no longer had a certain balance AND if he didn’t have a direct deposit any longer. Which I’m sure they left out on purpose. They stole TONS OF MY MONEY and never have once been helpful IN ANY WAY.",
        "nombre_reviews": "17 reviews",
        "date_experience": "2 reviews",
        "reply": null
    }
]